ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/source/cy_i3c.c
/*******************************************************************************
*  Function Name: Cy_I3C_Init
****************************************************************************//**
*
* Initializes the I3C block.
*
* \param base
* The pointer to the I3C instance.
* 
* \param config
* The pointer to the configuration structure \ref cy_stc_i3c_config_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
* \note
* Ensure that the I3C block is disabled before calling this function.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_Init(I3C_CORE_Type *base, cy_stc_i3c_config_t const *config, cy_stc_i3c_context_t *context)
{
    if((NULL == base) || (NULL == config) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    CY_ASSERT_L3(CY_I3C_IS_MODE_VALID(config->i3cMode));
    CY_ASSERT_L3(CY_I3C_IS_BUS_MODE_VALID(config->i3cBusMode));

    /* Main master init */
    I3C->CTRL= I3C_CTRL_ENABLED_Msk; //Outside core register

    if(CY_I3C_MASTER == config->i3cMode)
    {
        cy_stc_i3c_master_t *i3cMaster = &(context->i3cMaster);
        uint8_t address; 
        cy_en_i3c_status_t retStatus;

        i3cMaster->freePos = 0x7FFUL;
        i3cMaster->lastAddress = 0;
        i3cMaster->devCount = 0;
        i3cMaster->i2cDeviceCount = 0;
        i3cMaster->dynAddrDevCount = 0;

        // Prepare the address slot status array
        InitAddrslots(context);

        //Assigning address to the master
        retStatus = Cy_I3C_MasterGetFreeDeviceAddress(base, &address, context);
        if(CY_I3C_MASTER_FREE_ADDR_UNAVIAL == retStatus)
            return retStatus;
        
        I3C_CORE_DEVICE_ADDR(base) = _VAL2FLD( I3C_CORE_DEVICE_ADDR_DYNAMIC_ADDR, address) | I3C_CORE_DEVICE_ADDR_DYNAMIC_ADDR_VALID_Msk;

        SetAddrslotStatus(address, CY_I3C_ADDR_SLOT_I3C_DEV, context); 

        i3cMaster->lastAddress = address;
        I3C_CORE_DEVICE_CTRL(base) = I3C_CORE_DEVICE_CTRL_IBA_INCLUDE_Msk;
        //Setting the device operation mode to Master
        I3C_CORE_DEVICE_CTRL_EXTENDED(base) = _VAL2FLD(I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE, 0);

        Cy_I3C_SetDataRate(base, config->i3cSclRate, config->i3cClockHz, context); 

        Cy_I3C_SetInterruptMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
        Cy_I3C_SetInterruptStatusMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
    
    }

    if((config->i3cMode == CY_I3C_SLAVE) || (config->i3cMode == CY_I3C_SECONDARY_MASTER))
    {
        if(config->staticAddress)
        {
            /* The reset value of these fields are set from strap input static_addr_en and statis_addr. 
               The application can overwrite this value by programming this register before enabling the controller */

            I3C->STATIC_ADDR = I3C_STATIC_ADDR_STATIC_ADDR_EN_Msk;
            
            I3C_CORE_DEVICE_ADDR(base) |= _VAL2FLD(I3C_CORE_DEVICE_ADDR_STATIC_ADDR, config->staticAddress) |
                                          I3C_CORE_DEVICE_ADDR_STATIC_ADDR_VALID_Msk;
        }

        /*
            1. Configure the SLV_CHAR_CTRL register
            2. Configure the two PID registers
            3. Configure DEVICE_CTRL_EXTENDED register
            4. Configure ADAPTIVE_I2C_I3C field in DEVICE_CTRL register
        */
        
        I3C_CORE_SLV_CHAR_CTRL(base) &= _VAL2FLD(I3C_CORE_SLV_CHAR_CTRL_MAX_DATA_SPEED_LIMIT, config->speedLimit) |
                                        _VAL2FLD(I3C_CORE_SLV_CHAR_CTRL_HDR_CAPABLE, config->hdrCapable) |
                                        _VAL2FLD(I3C_CORE_SLV_CHAR_CTRL_DEVICE_ROLE, 0);
        
        I3C_CORE_DEVICE_CTRL_EXTENDED(base) = _VAL2FLD(I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE, config->i3cMode);
        
        //I3C_CORE_SLV_PID_VALUE(base) = (uint32_t)config->pid;

        /* On setting this ADAPTIVE_I2C_I3C bit, the controller generates hot-join request only when the is in/changes to I3C mode of operation. */
        //I3C_CORE_DEVICE_CTRL(base) |= I3C_CORE_DEVICE_CTRL_ADAPTIVE_I2C_I3C_Msk; //tbd - ask about the idle count multiplier

    /* Note:
        1. If this bit is set, the controller is allowed to send hot-join request intr on the bus. This bit, if set, can be set or cleared by the I3C master
           via ENEC or DISEC CCCs.
        2. If this bit is set to 0, the controller will not be allowed to send hot-join request intr on the bus. The CCCs will not have any effects on this field.
    */
    
        I3C_CORE_SLV_EVENT_STATUS(base) &= (config->hotjoinEnable)?I3C_CORE_SLV_EVENT_STATUS_HJ_EN_Msk:(~I3C_CORE_SLV_EVENT_STATUS_HJ_EN_Msk);

        //Sets the number of entries in the Receive FIFO that trigger the interrupt to 1 word
        I3C_CORE_DATA_BUFFER_THLD_CTRL(base) &= _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_RX_BUF_THLD, 5) |
                                                _VAL2FLD(I3C_CORE_DATA_BUFFER_STATUS_LEVEL_TX_BUF_EMPTY_LOC, 1);

        if(config->i3cMode == CY_I3C_SECONDARY_MASTER)
        {
            Cy_I3C_SetInterruptMask(base, CY_I3C_SLV_INTR_Msk | CY_I3C_INTR_DEFSLV_STS);
            Cy_I3C_SetInterruptStatusMask(base, CY_I3C_SLV_INTR_Msk | CY_I3C_INTR_DEFSLV_STS);
        }

        else
        {
            Cy_I3C_SetInterruptMask(base, CY_I3C_SLV_INTR_Msk);
            Cy_I3C_SetInterruptStatusMask(base, CY_I3C_SLV_INTR_Msk);
        }

        context->i3cSclRate = config->i3cSclRate;
    }

    // Configure the registers
    
    //Sets the number of entries in the Response Queue that trigger the interrupt to 1 word
    //and the number of entries in the IBI Queue that trigger the interrupt to 1 word
    
    I3C_CORE_QUEUE_THLD_CTRL(base) = _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_RESP_BUF_THLD, 0) |
                                     _VAL2FLD(I3C_CORE_QUEUE_THLD_CTRL_IBI_STATUS_THLD, 0);
    
    /* Initialize the context */
    context->i3cMode = config->i3cMode;
    context->i3cBusMode = config->i3cBusMode;
    context->i3cClockHz = config->i3cClockHz;
    context->state = CY_I3C_IDLE;
    
    /* Master specific */
    context->masterBuffer = NULL;
    context->masterStatus = 0UL;
    context->masterBufferIdx = 0UL;
    context->masterBufferSize = 0UL;
    context->destDeviceAddr = 0UL;
    context->hdrCmd = NULL;
    
    /*Slave specific */
    context->slaveStatus = 0UL;
    
