ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/source/cy_i3c.c
    context->slaveRxBuffer = NULL;
    context->slaveRxBufferIdx = 0UL;
    context->slaveRxBufferSize = 0UL;
    context->slaveRxBufferCnt = 0UL;
    
    context->slaveTxBuffer = NULL;
    context->slaveTxBufferIdx = 0UL;
    context->slaveTxBufferSize = 0UL;
    context->slaveTxBufferCnt = 0UL;
    
    /* Unregister callbacks */
    context->cbEvents = NULL;
    context->cbIbi = NULL;

    return CY_I3C_SUCCESS;
    
}


/*******************************************************************************
*  Function Name: Cy_I3C_Deinit
****************************************************************************//**
*
* Deinitializes the I3C block.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
void Cy_I3C_DeInit(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != context);
    
    uint8_t index;

    Cy_I3C_Disable(base);
    if(CY_I3C_SLAVE != context->i3cMode) //Test: Should this be done for secondary master too?
    {
        //Set the address slot statuses to zero
        DeInitAddrslots(context);

        for(index = 0; (index < CY_I3C_MAX_DEVS); index++)
        {
            //Clears the DAT entries
            Cy_I3C_WriteIntoDeviceAddressTable(base, index, 0UL);
        }
    }
    I3C_CORE_QUEUE_THLD_CTRL(base) = I3C_CORE_QUEUE_THLD_CTRL_DEF_VAL;
    I3C_CORE_DATA_BUFFER_THLD_CTRL(base) = I3C_CORE_DATA_BUFFER_THLD_CTRL_DEF_VAL;

    I3C_CORE_INTR_STATUS_EN(base) = 0UL;
    I3C_CORE_INTR_SIGNAL_EN(base) = 0UL;

}


/*******************************************************************************
*  Function Name: Cy_I3C_MasterI2CAttachDevice
****************************************************************************//**
*
* Attaches an I2C device to the bus as defined by \ref cy_stc_i2c_device_t.
* It is required to provide device static address and lvr information 
* in \ref cy_stc_i2c_device_t.
*
* \param base
* The pointer to the I3C instance.
* 
* \param i2cDevice
* The pointer to the I2C device description structure \ref cy_stc_i2c_device_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_MasterAttachI2CDevice(I3C_CORE_Type *base, cy_stc_i2c_device_t *i2cDevice, cy_stc_i3c_context_t *context)
{
    
    if((NULL == base) || (NULL == i2cDevice) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }
    
    cy_stc_i3c_master_t *i3cMaster = &(context->i3cMaster);
    uint32_t value, pos;
    uint8_t lvr;

    if(CY_I3C_MAX_DEVS <= (i3cMaster->devCount))  //cannot initialize the device as the bus already has 11 devices on it
        return CY_I3C_MASTER_MAX_DEVS_PRESENT;
        
    /* LVR: Legacy Virtual Register

    bit[7-5]: 000 - Legacy I2C only with 50ns IO Spike Filter
              001 and 010 - Legacy I2C only without 50ns IO Spike Filter
              others - reserved */
              
    lvr = i2cDevice->lvr;

    if( CY_I3C_ADDR_SLOT_FREE != GetAaddrslotStatus(i2cDevice->staticAddress, context))
        return CY_I3C_MASTER_FREE_ADDR_UNAVIAL;
    
    if(0 != (CY_I3C_LVR_LEGACY_I2C_INDEX_MASK & lvr)) //does not have a 50ns Spike Filter, So return - BROS mentions not to support devices that lack the spike filters
        return CY_I3C_MASTER_BAD_I2C_DEVICE;  
    
    SetAddrslotStatus(i2cDevice->staticAddress, CY_I3C_ADDR_SLOT_I2C_DEV, context);

    // populate the device address table with the static address of the device
    value = _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_STATIC_ADDR, i2cDevice->staticAddress) |
            I3C_CORE_DEV_ADDR_TABLE_LOC1_LEGACY_I2C_DEVICE_Msk;

    pos = GetDATFreePos(base, context);
    
    Cy_I3C_WriteIntoDeviceAddressTable(base, pos, value);

    //Maintaining a local list of i2c devices
    Cy_I3C_UpdateI2CDevInList(i2cDevice, pos, context);
    
    //increment the free position index of the device address table
    (i3cMaster->freePos) = ~ (CY_I3C_BIT(pos));
    (i3cMaster->devCount)++;
    (i3cMaster->i2cDeviceCount)++;

    I3C_CORE_DEVICE_CTRL(base) |= I3C_CORE_DEVICE_CTRL_I2C_SLAVE_PRESENT_Msk;

    return CY_I3C_SUCCESS;
}


/*******************************************************************************
*  Function Name: Cy_I3C_MasterDetachI2CDevice
****************************************************************************//**
*
* Detaches an I2C device from the bus defined by \ref cy_stc_i2c_device_t.
*
* \param base
* The pointer to the I3C instance.
* 
* \param i2cDevice
* pointer to the I2C device description structure \ref cy_stc_i2c_device_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_MasterDetachI2CDevice(I3C_CORE_Type *base, cy_stc_i2c_device_t *i2cDevice, cy_stc_i3c_context_t *context)
{
    if((NULL == base) || (NULL == i2cDevice) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }
    
    uint32_t devIndex;

    //"devIndex" - Position of the device which has to be detached
    devIndex = GetI2CDevAddrPos(base, i2cDevice->staticAddress, context);
    if(devIndex == CY_I3C_BAD_PARAM)
        return CY_I3C_BAD_PARAM;
    
    RearrangeAddrTable(base, devIndex, context);

    context->i3cMaster.devCount--;
    context->i3cMaster.i2cDeviceCount--;
    SetAddrslotStatus((i2cDevice->staticAddress), CY_I3C_ADDR_SLOT_FREE, context);
    
