ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/source/cy_i3c.c
    return CY_I3C_SUCCESS;
}


/*******************************************************************************
*  Function Name: Cy_I3C_MasterI3CAttachDevice
****************************************************************************//**
*
* Attaches an I3C device to the bus defined by \ref cy_stc_i3c_device_t.
*
* \param base
* The pointer to the I3C instance.
* 
* \param i3cDevice
* The pointer to the i3c device description structure \ref cy_stc_i3c_device_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
/* This is blocking function, where we wait for the response packet, 
   assuming the master treats no response as NACK after waiting for a decent amount of time */
cy_en_i3c_status_t Cy_I3C_MasterAttachI3CDevice(I3C_CORE_Type *base, cy_stc_i3c_device_t *i3cDevice, cy_stc_i3c_context_t *context)
{
    if((NULL == base) || (NULL == i3cDevice) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }
    
    uint8_t dynamicAddress = 0;
    cy_en_i3c_status_t retStatus;
    cy_stc_i3c_master_t *i3cMaster = &(context->i3cMaster);
    cy_stc_i3c_ccc_cmd_t cmd;
    cy_stc_i3c_ccc_setda_t i3cCccSetda;
    cy_stc_i3c_ccc_payload_t payload;

    if(CY_I3C_MAX_DEVS <= (i3cMaster->devCount))  //cannot initialize the device as the bus already has 11 devices on it
        return CY_I3C_MASTER_MAX_DEVS_PRESENT;

    if(0 != i3cDevice->dynamicAddress)
    {
        /* device has a expected dynamic address */

        /* check if the expected dynamic address is available to be assigned */ 
        /* If not available, return */
        
        if(CY_I3C_ADDR_SLOT_FREE != GetAaddrslotStatus(i3cDevice->dynamicAddress, context))
            return CY_I3C_MASTER_FREE_ADDR_UNAVIAL;
        
        dynamicAddress = i3cDevice->dynamicAddress;
    }

    else
    {
        /* If the Slave device doesn't have a expected dynamic address, pick a free address from the list */    
        retStatus = Cy_I3C_MasterGetFreeDeviceAddress(base, &dynamicAddress, context);
        if(CY_I3C_MASTER_FREE_ADDR_UNAVIAL == retStatus)
            return retStatus;

        i3cMaster->lastAddress = dynamicAddress;
    }

    //Send SETDASA CCC command
    i3cCccSetda.address = dynamicAddress;
    cmd.data = &payload;
    cmd.data->data = &(i3cCccSetda.address); //check
    cmd.data->len = sizeof(i3cCccSetda);
    cmd.cmd = CY_I3C_CCC_SETDASA;
    cmd.address = i3cDevice->staticAddress;
    retStatus = setdasa_ccc(base, &cmd, context);

    return retStatus;
    
}


/*******************************************************************************
*  Function Name: Cy_I3C_MasterDetachI3CDevice
****************************************************************************//**
*
* Detaches an I3C device from the bus defined by \ref cy_stc_i3c_device_t.
*
* \param base
* The pointer to the I3C instance.
* 
* \param i3cDevice
* The pointer to the I3C device description structure \ref cy_stc_i3c_device_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
//TBD - Check if the device is hot-join capable, if yes send DISEC with HOT-JOIN event
cy_en_i3c_status_t Cy_I3C_MasterDetachI3CDevice(I3C_CORE_Type *base, cy_stc_i3c_device_t *i3cDevice, cy_stc_i3c_context_t *context)
{
    if((NULL == base) || (NULL == i3cDevice) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }
    
    uint32_t devIndex ;
    cy_en_i3c_status_t retstatus;
    cy_stc_i3c_ccc_cmd_t cccCmd;
    cy_stc_i3c_ccc_payload_t payload;
    
    devIndex = GetI3CDevAddrPos(base, i3cDevice->dynamicAddress, context);
    if(CY_I3C_BAD_PARAM == devIndex)
        return CY_I3C_BAD_PARAM;

    cccCmd.address = i3cDevice->dynamicAddress;
    cccCmd.cmd = CY_I3C_CCC_RSTDAA(false);
    cccCmd.data = &payload;
    cccCmd.data->data = NULL;
    cccCmd.data->len = 0;

    retstatus = rstdaa_ccc(base, &cccCmd, context);
    if(CY_I3C_SUCCESS != retstatus)
        return retstatus;

    RearrangeAddrTable(base, devIndex, context);

    context->i3cMaster.devCount--;
    SetAddrslotStatus((i3cDevice->dynamicAddress), CY_I3C_ADDR_SLOT_FREE, context);

    return CY_I3C_SUCCESS;
}


/*******************************************************************************
*  Function Name: Cy_I3C_Enable
****************************************************************************//**
* Enables the I3C block.
*
* \param base
* The pointer to the I3C instance.
*
*******************************************************************************/
void Cy_I3C_Enable(I3C_CORE_Type *base)
{
    CY_ASSERT_L1(NULL != base);
    
    I3C_CORE_DEVICE_CTRL(base) |= I3C_CORE_DEVICE_CTRL_ENABLE_Msk;
}


/*******************************************************************************
*  Function Name: Cy_I3C_Disable
****************************************************************************//**
* Disables the I3C block.
*
* \param base
* The pointer to the I3C instance.
*
* \note
* The I3C controller will complete any pending bus transaction before it gets
* disabled.
*******************************************************************************/
void Cy_I3C_Disable(I3C_CORE_Type *base)
{
    CY_ASSERT_L1(NULL != base);

    I3C_CORE_DEVICE_CTRL(base) |= (~I3C_CORE_DEVICE_CTRL_ENABLE_Msk);

    do
    {
        //Wait until the master comes to IDLE state
    }while(I3C_CORE_PRESENT_STATE(base));
}


/*******************************************************************************
*  Function Name: Cy_I3C_Resume
****************************************************************************//**
*
* Resumes the I3C Controller after an error state.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \note
* When the controller enters any error condition it pauses all operation until 
* user resumes manually. User must call this API once error status is returned 
* for any I3C bus transactions like Read/Write or other operations.
*
*******************************************************************************/
void Cy_I3C_Resume(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != context);

