ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/source/cy_i3c.c
    //case when a device is detached from the bus and the address is available
    for(freeAddress = 1; freeAddress < startAddress; freeAddress++)
    {
        status = GetAaddrslotStatus(freeAddress, context);
        if(CY_I3C_ADDR_SLOT_FREE == status)
        {
            *address = freeAddress;
            return CY_I3C_SUCCESS;
        }
    }

    return CY_I3C_MASTER_FREE_ADDR_UNAVIAL;
}


/*******************************************************************************
*  Function Name: Cy_I3C_isCCCCmdSupported
****************************************************************************//**
*
* Checks if the CCC command is supported.
*
* \param base
* The pointer to the I3C instance.
* 
* \param cccCmd
* The CCC command to be checked.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* ture: If the specified command is supported
* false: If the specified command is not supported.
*
*******************************************************************************/
bool Cy_I3C_isCCCCmdSupported(I3C_CORE_Type *base, uint8_t cccCmd, cy_stc_i3c_context_t *context)
{
    if((NULL == base) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    /* Suppress a compiler warning about unused variables */
    (void) base;

    switch (cccCmd)
        {
            case CY_I3C_CCC_ENEC(true):
            case CY_I3C_CCC_ENEC(false):
            case CY_I3C_CCC_DISEC(true):
            case CY_I3C_CCC_DISEC(false):
            case CY_I3C_CCC_ENTAS(0, true):
            case CY_I3C_CCC_ENTAS(0, false):
            case CY_I3C_CCC_RSTDAA(true):
            case CY_I3C_CCC_RSTDAA(false):
            case CY_I3C_CCC_ENTDAA:
            case CY_I3C_CCC_SETMWL(true):
            case CY_I3C_CCC_SETMWL(false):
            case CY_I3C_CCC_SETMRL(true):
            case CY_I3C_CCC_SETMRL(false):
            case CY_I3C_CCC_ENTHDR(0):
            case CY_I3C_CCC_SETDASA:
            case CY_I3C_CCC_SETNEWDA:
            case CY_I3C_CCC_GETMWL:
            case CY_I3C_CCC_GETMRL:
            case CY_I3C_CCC_GETPID:
            case CY_I3C_CCC_GETBCR:
            case CY_I3C_CCC_GETDCR:
            case CY_I3C_CCC_GETSTATUS:
            case CY_I3C_CCC_GETMXDS:
            case CY_I3C_CCC_GETHDRCAP:
            case CY_I3C_CCC_GETACCMST:
            case CY_I3C_CCC_DEFSLVS:
                return true;
            default:
                return false;
        }
}


/*******************************************************************************
*  Function Name: Cy_I3C_SendCCCCmd
****************************************************************************//**
*
* Post the specified CCC command to command queue.
*
* \param base
* The pointer to the I3C instance.
* 
* \param cccCmd
* The pointer to the CCC command description structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* ref cy_en_i3c_status_t.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_SendCCCCmd(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    if((NULL == base) || (NULL == cccCmd) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    cy_en_i3c_status_t retStatus;

    context->masterStatus = CY_I3C_MASTER_BUSY;
    switch(cccCmd->cmd)
    {
        case CY_I3C_CCC_ENEC(true):
        case CY_I3C_CCC_ENEC(false): 
        case CY_I3C_CCC_DISEC(true):
        case CY_I3C_CCC_DISEC(false):
            {
                retStatus = enec_disec_ccc(base, cccCmd, context); 
                break;
            }
        case CY_I3C_CCC_RSTDAA(true):
        case CY_I3C_CCC_RSTDAA(false):
            {
                retStatus = rstdaa_ccc(base, cccCmd, context); 
                break;
            }
        case CY_I3C_CCC_SETMWL(true):
        case CY_I3C_CCC_SETMWL(false):
        case CY_I3C_CCC_SETMRL(true):
        case CY_I3C_CCC_SETMRL(false):
            {
                retStatus = setmrwl_ccc(base, cccCmd, context); 
                break;
            }
        case CY_I3C_CCC_SETDASA:
            {
                retStatus = setdasa_ccc(base, cccCmd, context);
                break;
            }
        case CY_I3C_CCC_SETNEWDA:
            {
                retStatus = setnewda_ccc(base, cccCmd, context);
                break;
            }
        case CY_I3C_CCC_GETMWL:
        case CY_I3C_CCC_GETMRL:
            {
                retStatus = getmrwl_ccc(base, cccCmd, context);
                break;
            }
        
        case CY_I3C_CCC_GETPID:
            {
                retStatus = getpid_ccc(base, cccCmd, context);
                break;
            }
        case CY_I3C_CCC_GETBCR:
            {
                retStatus = getbcr_ccc(base, cccCmd, context);
                break;
            }
        case CY_I3C_CCC_GETDCR:
            {
                retStatus = getdcr_ccc(base, cccCmd, context);
                break;
            }
        case CY_I3C_CCC_GETSTATUS:
            {
                retStatus = getstatus_ccc(base, cccCmd, context);
                break;
            }
        case CY_I3C_CCC_GETMXDS:
            {
                retStatus = getmxds_ccc(base, cccCmd, context);
                break;
            }
        case CY_I3C_CCC_GETHDRCAP:
            {
                retStatus = gethdrcap_ccc(base, cccCmd, context);
                break;
            }
        case CY_I3C_CCC_ENTAS(0, true):
        case CY_I3C_CCC_ENTAS(0, false):
        case CY_I3C_CCC_ENTAS(1, true):
        case CY_I3C_CCC_ENTAS(1, false):
        case CY_I3C_CCC_ENTAS(2, true):
        case CY_I3C_CCC_ENTAS(2, false):
        case CY_I3C_CCC_ENTAS(3, true):
        case CY_I3C_CCC_ENTAS(3, false):
            {
                retStatus = entas_ccc(base, cccCmd, context);
                break;
            }
        case CY_I3C_CCC_ENTHDR(0):
            {
                retStatus = enthdr0_ccc(base, cccCmd, context);
                break;
            }
        case CY_I3C_CCC_GETACCMST:
            {
                retStatus = getaccmst_ccc(base, cccCmd, context);
                break;
            }
        case CY_I3C_CCC_DEFSLVS:
            {
                retStatus = defslvs_ccc(base, cccCmd, context);
                break;
            }
        default:
            {
                retStatus = CY_I3C_MASTER_CCC_NOT_SUPPORTED;
            }
    }

    context->masterStatus &= (~CY_I3C_MASTER_BUSY);
    return retStatus;
}


