ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/source/cy_i3c.c
    if(CY_I3C_IDLE != context->state)
    {
        uint32_t intrState;
        I3C_CORE_DEVICE_CTRL(base) = I3C_CORE_DEVICE_CTRL_ABORT_Msk;

        intrState = Cy_SysLib_EnterCriticalSection();
        Cy_I3C_SetInterruptMask(base, CY_I3C_INTR_TRANSFER_ABORT_STS);
        Cy_I3C_SetInterruptStatusMask(base, CY_I3C_INTR_TRANSFER_ABORT_STS);
        Cy_SysLib_ExitCriticalSection(intrState);
    }
}

/*******************************************************************************
*  Function Name: Cy_I3C_MasterWriteByte
****************************************************************************//**
*
* Sends one byte to a slave.
* This function is blocking.
*
* \param base
* The pointer to the I3C instance.
* 
* \param slaveAddress
* The dynamic address of the target I3C slave device.
*
* \param data
* The byte to write to the slave.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* ref cy_en_i3c_status_t.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_MasterWriteByte(I3C_CORE_Type *base, uint8_t slaveAddress, int8_t data, cy_stc_i3c_context_t *context)
{
    if((NULL == base) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }
    
    CY_ASSERT_L2(CY_IS_I3C_ADDR_VALID(slaveAddress));
    
    cy_en_i3c_status_t retStatus = CY_I3C_MASTER_NOT_READY;
    
    if(0 != (CY_I3C_IDLE_MASK & context->state))
    {
        uint8_t res;
        cy_stc_i3c_ccc_t cmd;
        uint8_t pos = 0;
        cy_stc_i3c_master_devlist_t *i3cDeviceList;
        uint8_t writeDSMode = CY_I3C_SDR0;
        uint32_t respCmdPort;

        context->masterStatus = CY_I3C_MASTER_BUSY;
        
        cmd.cmdHigh = 0UL;
        cmd.cmdLow = 0UL;

        //Clear the interrupts
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);

        //Reset the Tx FIFO
        I3C_CORE_RESET_CTRL(base) |= I3C_CORE_RESET_CTRL_TX_FIFO_RST_Msk;
        
        res = GetAaddrslotStatus(slaveAddress, context);

        //This helps to check if the device is actively present on the bus
        if((CY_I3C_ADDR_SLOT_I3C_DEV != res ) && (CY_I3C_ADDR_SLOT_I2C_DEV != res))
            return CY_I3C_BAD_PARAM; 

        if(CY_I3C_ADDR_SLOT_I2C_DEV == res)
        {
            //The target device is an i2cDevice
            pos = GetI2CDevAddrPos(base, slaveAddress, context);
            i3cDeviceList = &(context->devList[pos]); //pointing to the device position in the local list of devices on the bus
            writeDSMode = (i3cDeviceList->i2cDevice.lvr & CY_I3C_LVR_I2C_MODE_INDICATOR) ? CY_I3C_FM_I2C: CY_I3C_FMP_I2C;
            context->masterStatus |= CY_I3C_MASTER_I2C_SDR_WR_XFER;
        }

        else
        {
            //The target is an i3cDevice
            pos = GetI3CDevAddrPos(base, slaveAddress, context);
            i3cDeviceList = &(context->devList[pos]); //pointing to the device position in the local list of devices on the bus
            if(CY_I3C_CORE_BCR_MAX_DATA_SPEED_LIM_Msk == (i3cDeviceList->i3cDevice.bcr))
            {
                writeDSMode = (i3cDeviceList->i3cDevice.maxWriteDs) & 0x07;
            }
            context->masterStatus |= CY_I3C_MASTER_I3C_SDR_WR_XFER;
        }

        cmd.cmdHigh |= I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_SHORT_DATA_ARG |
                       _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_BYTE_STRB, 1) |
                       _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_SHORT_DATA_ARG_DATA_BYTE_0, data);

        cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_CMD |
                      _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_DEV_INDX, pos) |
                      _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SPEED, writeDSMode) |
                      I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_ROC_Msk |
                      I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SDAP_Msk |
                      I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TOC_Msk;

        context->state = CY_I3C_MASTER_TX;

        // Disbale the interrupt signals by clearing the bits
        Cy_I3C_SetInterruptMask(base, 0UL);
        Cy_I3C_SetInterruptStatusMask(base, (CY_I3C_INTR_RESP_READY_STS | CY_I3C_INTR_TRANSFER_ERR_STS));

        I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdHigh;
        I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdLow;

        do
        {
            //wait till the interrupt of response is received
        }while(0 == ((CY_I3C_INTR_RESP_READY_STS | CY_I3C_INTR_TRANSFER_ERR_STS) & Cy_I3C_GetInterruptStatus(base)));

        respCmdPort = I3C_CORE_RESPONSE_QUEUE_PORT(base);
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);
        Cy_I3C_SetInterruptStatusMask(base, 0);
    
        if(0 != (respCmdPort & I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_ERR_STS_Msk))
        {
            retStatus = ResponseError(respCmdPort);    //unsuccessful due to transfer error
            context->masterStatus |= CY_I3C_MASTER_HALT_STATE;
        }

        else
        {
            retStatus = CY_I3C_SUCCESS;
        }
        context->masterStatus &= (~CY_I3C_MASTER_BUSY);
        context->state = CY_I3C_IDLE;
    }

    return retStatus;
}

/*******************************************************************************
*  Function Name: Cy_I3C_MasterReadByte
****************************************************************************//**
*
* Reads one byte from a slave.
* This function is blocking.
*
* \param base
* The pointer to the I3C instance.
* 
* \param slaveAddress
* The dynamic address of the target I3C slave device.
*
* \param data
* The pointer to the location to store the Read byte.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* ref cy_en_i3c_status_t.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_MasterReadByte(I3C_CORE_Type *base, uint8_t slaveAddress, int8_t *data, cy_stc_i3c_context_t *context)
{
    if((NULL == base) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }
    
    CY_ASSERT_L2(CY_IS_I3C_ADDR_VALID(slaveAddress));
    
