ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/source/cy_i3c.c
    cy_en_i3c_status_t retStatus = CY_I3C_MASTER_NOT_READY;
    
    if(0 != (CY_I3C_IDLE_MASK & context->state))
    {
        uint8_t res;
        cy_stc_i3c_ccc_t cmd;
        uint8_t pos = 0;
        cy_stc_i3c_master_devlist_t *i3cDeviceList;
        uint8_t readDSMode = CY_I3C_SDR0;
        uint32_t respCmdPort, datalen;

        context->masterStatus = CY_I3C_MASTER_BUSY;
        
        cmd.cmdHigh = 0UL;
        cmd.cmdLow = 0UL;

        //Clear the interrupts
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);

        //Reset the Tx FIFO
        I3C_CORE_RESET_CTRL(base) |= I3C_CORE_RESET_CTRL_TX_FIFO_RST_Msk;
        
        res = GetAaddrslotStatus(slaveAddress, context);

        //This helps to check if the device is actively present on the bus
        if((CY_I3C_ADDR_SLOT_I3C_DEV != res ) && (CY_I3C_ADDR_SLOT_I2C_DEV != res))
            return CY_I3C_BAD_PARAM; 

        if(CY_I3C_ADDR_SLOT_I2C_DEV == res)
        {
            //The target device is an i2cDevice
            pos = GetI2CDevAddrPos(base, slaveAddress, context);
            i3cDeviceList = &(context->devList[pos]); //pointing to the device position in the local list of devices on the bus
            readDSMode = (i3cDeviceList->i2cDevice.lvr & CY_I3C_LVR_I2C_MODE_INDICATOR) ? CY_I3C_FM_I2C: CY_I3C_FMP_I2C;
            context->masterStatus |= CY_I3C_MASTER_I2C_SDR_RD_XFER;
        }

        else
        {
            //The target is an i3cDevice
            pos = GetI3CDevAddrPos(base, slaveAddress, context);
            i3cDeviceList = &(context->devList[pos]); //pointing to the device position in the local list of devices on the bus
            if(CY_I3C_CORE_BCR_MAX_DATA_SPEED_LIM_Msk == (i3cDeviceList->i3cDevice.bcr))
            {
                readDSMode = (i3cDeviceList->i3cDevice.maxReadDs) & 0x07;
            }
            context->masterStatus |= CY_I3C_MASTER_I3C_SDR_RD_XFER;
        }

        cmd.cmdHigh |= I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_ARG |
                       _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_ARG_DATA_LENGTH, 1);

        cmd.cmdLow |= I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_TRANSFER_CMD |
                       _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_SPEED, readDSMode) |
                       _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_DEV_INDX, pos) |
                       I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_RnW_Msk |
                       I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_ROC_Msk |
                       I3C_CORE_COMMAND_QUEUE_PORT_TRANSFER_CMD_TOC_Msk;

        context->state = CY_I3C_MASTER_RX;

        // Disbale the interrupt signals by clearing the bits
        Cy_I3C_SetInterruptMask(base, 0UL);
        Cy_I3C_SetInterruptStatusMask(base, (CY_I3C_INTR_RESP_READY_STS | CY_I3C_INTR_TRANSFER_ERR_STS));

        I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdHigh;
        I3C_CORE_COMMAND_QUEUE_PORT(base) = cmd.cmdLow;

        do
        {
            //wait till the interrupt of response is received
        }while(0 == ((CY_I3C_INTR_RESP_READY_STS | CY_I3C_INTR_TRANSFER_ERR_STS) & Cy_I3C_GetInterruptStatus(base)));

        respCmdPort = I3C_CORE_RESPONSE_QUEUE_PORT(base);
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);
        Cy_I3C_SetInterruptStatusMask(base, 0);
    
        if(0 != (respCmdPort & I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_ERR_STS_Msk))
        {
            retStatus = ResponseError(respCmdPort);    //unsuccessful due to transfer error
            context->masterStatus |= CY_I3C_MASTER_HALT_STATE;
        }

        else
        {
            datalen = (respCmdPort & I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk);
            if(1 == datalen)
            {
                *data = (uint8_t)Cy_I3C_ReadRxFIFO(base);
                retStatus = CY_I3C_SUCCESS;
            }
            else
            {
                retStatus = CY_I3C_MASTER_ERROR_M0;
            }
        }
        context->masterStatus &= (~CY_I3C_MASTER_BUSY);
        context->state = CY_I3C_IDLE;
    }

    return retStatus;
}

/*******************************************************************************
*  Function Name: Cy_I3C_GetBusStatus
****************************************************************************//**
*
* Returns the current I2C master status.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref group_i3c_macros_master_status.
* Note that not all I3C master statuses are returned by this function. Refer to
* more details of each status.
*
*******************************************************************************/
uint32_t Cy_I3C_GetBusStatus(I3C_CORE_Type const *base, cy_stc_i3c_context_t const *context)
{
    if((NULL == base) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }
    
    (void) base;
    #if 0
    uint32_t ret;
    ret = _FLD2VAL(I3C_CORE_PRESENT_STATE_CM_TFR_STS, I3C_CORE_PRESENT_STATE(base));
    //Gives the state of the transfer currently being executed by the controller

    return ret;
    #endif
    
    if(CY_I3C_MASTER == Cy_I3C_GetMode(base))
        return (context->masterStatus);

    else
        return(context->slaveStatus);
    
}

/* DAA */
/* About DAA:
1. This has the responsibility of finding the number of devices required to be assigned dynamic addresses
2. Getting the free addresses
3. Polpulating the DAT
4. Populating the COMMAND DATA PORT 
5. Poll for the response and update the DAT free pos index based on the response received */

/*******************************************************************************
*  Function Name: Cy_I3C_MasterStartEntDaa
****************************************************************************//**
*
* Issues ENTDAA CCC command to discover the i3c devices on the bus and assigns 
* valid dynamic addreses to the discovered devices.
* This CCC is to be issued also when a device hot joins the bus.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_MasterStartEntDaa(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    if((NULL == base) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    cy_stc_i3c_master_t *i3cMaster = &(context->i3cMaster);
    cy_stc_i3c_device_t i3cDev;
    uint8_t i3cDevCount; //to store the number of devices to be assigned the dynamic address
    uint8_t dynamicAddress;
    uint8_t index, parity, pos;
    uint32_t respCmdPort;
    uint16_t respLeftDevCount;
    uint32_t value;
    cy_en_i3c_status_t retStatus;
    cy_stc_i3c_ccc_cmd_t cccCmd;
    cy_stc_i3c_ccc_payload_t payload;
    
    if(CY_I3C_MAX_DEVS <= (i3cMaster->devCount))  //cannot initialize the device as the bus already has 11 devices on it
        return CY_I3C_MASTER_MAX_DEVS_PRESENT; 
    
    i3cDevCount = CY_I3C_MAX_DEVS - (i3cMaster->devCount);
    
    //Get "free address" position
    pos = GetDATFreePos(base, context);

