ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/source/cy_i3c.c
    //Get the 'i3cDevCount' number of free addresses and populate the DAT before issuing ENTDAA CCC
    for(index = pos; index < i3cDevCount; index++)
    {
        retStatus = Cy_I3C_MasterGetFreeDeviceAddress(base, &dynamicAddress, context);
        if(CY_I3C_MASTER_FREE_ADDR_UNAVIAL == retStatus)
            return retStatus;

        parity = even_parity(dynamicAddress);
        i3cMaster->lastAddress = dynamicAddress;
        dynamicAddress |= (parity << 7);

        //populate the device address table with the dynmaic address of the device
        value = _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_DYNAMIC_ADDR, dynamicAddress);
    
        Cy_I3C_WriteIntoDeviceAddressTable(base, index, value);
    }

    context->masterStatus = CY_I3C_MASTER_BUSY | CY_I3C_MASTER_ENTDAA_XFER;
    
    // Disbale the interrupt signals by clearing the bits
    Cy_I3C_SetInterruptMask(base, 0UL);
    Cy_I3C_SetInterruptStatusMask(base, (CY_I3C_INTR_RESP_READY_STS | CY_I3C_INTR_TRANSFER_ERR_STS));

    I3C_CORE_COMMAND_QUEUE_PORT(base) = I3C_CORE_COMMAND_QUEUE_PORT_CMD_ATTR_ADDR_ASSGN_CMD | 
                                        _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_CMD, CY_I3C_CCC_ENTDAA) |
                                        _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_DEV_INDX, pos) |
                                        _VAL2FLD(I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_DEV_COUNT, i3cDevCount) |
                                        I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_ROC_Msk | 
                                        I3C_CORE_COMMAND_QUEUE_PORT_ADDR_ASSGN_CMD_TOC_Msk;

    //Handling the response
    do
    {
        //wait till the interrupt of response is received
    }while(0 == (CY_I3C_INTR_MASK & Cy_I3C_GetInterruptStatus(base)));

    respCmdPort = I3C_CORE_RESPONSE_QUEUE_PORT(base);
    Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);
    
    respLeftDevCount = (uint16_t)(respCmdPort & I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk); //represents the remaining device count

    if(0 != (respCmdPort & I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_ERR_STS_Msk))
    {
        if(4 != (_FLD2VAL(I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_ERR_STS, respCmdPort))) //TO DO: Use a macro instead of '4'
        {
            /* Error in transfer */
            retStatus = ResponseError(respCmdPort);
            context->masterStatus |= CY_I3C_MASTER_HALT_STATE;
            context->masterStatus &= (~CY_I3C_MASTER_BUSY);
            return retStatus;
        }
    }

    Cy_I3C_Resume(base, context);

    i3cMaster->dynAddrDevCount =  i3cDevCount - respLeftDevCount;  //Doubt - Will NACK be received here too?
    i3cMaster->devCount += i3cMaster->dynAddrDevCount;

    //Maintaining a local list of i3c devices
    for( index = 0; index < i3cMaster->dynAddrDevCount; index++)
    {
        Cy_I3C_ReadFromDevCharTable(base, index, &i3cDev);
        SetAddrslotStatus(i3cDev.dynamicAddress, CY_I3C_ADDR_SLOT_I3C_DEV, context);
        RetrieveI3CDeviceInfo(base, &i3cDev, false, context);
        i3cDev.staticAddress = 0;
        Cy_I3C_UpdateI3CDevInList(&i3cDev, pos, context);
        i3cMaster->freePos &= ~(CY_I3C_BIT(pos));
        pos++;
    }

    if(0 != i3cMaster->dynAddrDevCount)
    {
        //Send DEFSLVS and ENEC CCC commands
        cccCmd.address = CY_I3C_BROADCAST_ADDR;
        cccCmd.cmd = CY_I3C_CCC_DEFSLVS;
        cccCmd.data = &payload;
    
        defslvs_ccc(base, &cccCmd, context);
    }

    context->masterStatus &= (~CY_I3C_MASTER_BUSY);
    return CY_I3C_SUCCESS;

        
}

/*******************************************************************************
*  Function Name: Cy_I3C_MasterSendHdrCmds
****************************************************************************//**
*
* Writes data provided by xferConfig structure \ref cy_stc_i3c_master_xfer_config_t
* to a specific device.
*
* \param base
* The pointer to the I3C instance.
* 
* \param slaveAddress
* The dynamic address of the target I3C device.
*
* \param hdrCmd
* The pointer to HDR command description structure \ref cy_stc_i3c_hdr_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* ref cy_en_i3c_status_t.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_MasterSendHdrCmds(I3C_CORE_Type *base, uint8_t slaveAddress, cy_stc_i3c_hdr_cmd_t *hdrCmd, cy_stc_i3c_context_t *context)
{
    if((NULL == base) || (NULL == hdrCmd) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    uint8_t pos, res;
    cy_en_i3c_status_t retStatus = CY_I3C_MASTER_NOT_READY;

    if(0 != (CY_I3C_IDLE_MASK & context->state))
    {
        res = GetAaddrslotStatus(slaveAddress, context);

        //This helps to check if the device is actively present on the bus    
        if((CY_I3C_ADDR_SLOT_I3C_DEV != res ) && (CY_I3C_ADDR_SLOT_I2C_DEV != res))
            return CY_I3C_BAD_PARAM; 
        
        pos = GetI3CDevAddrPos( base, slaveAddress, context);

        cy_stc_i3c_master_devlist_t *i3cDevice = &(context->devList[pos]);

        if(false == (i3cDevice->i3cDevice.hdrSupport))
        {
            // The device doesn't support HDR mode
            return CY_I3C_NOT_HDR_CAP;
        }

        if(hdrCmd->code & CY_I3C_HDR_IS_READ_CMD)
        {
            uint8_t numToRead;
            numToRead = (hdrCmd->ndatawords*2);
            //Read command
            context->hdrCmd = hdrCmd;
            context->masterBuffer = (uint8_t *)hdrCmd->data.in;
            context->masterBufferSize = numToRead;
            context->destDeviceAddr = slaveAddress;
            context->masterStatus = CY_I3C_MASTER_BUSY;

            MasterHDRRead(base, hdrCmd, context);
        }

        else
        {
            // WRITE command
            context->hdrCmd = hdrCmd;
            context->masterBuffer = (uint8_t *)hdrCmd->data.out;
            context->masterBufferSize = (hdrCmd->ndatawords * 2);
            context->destDeviceAddr = slaveAddress;
            context->masterStatus = CY_I3C_MASTER_BUSY;

            MasterHDRWrite(base, hdrCmd, context);
        }
        retStatus = CY_I3C_SUCCESS;
    }

