ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/source/cy_i3c.c
/*******************************************************************************
*  Function Name: Cy_I3C_SlaveGetMaxWriteLength
****************************************************************************//**
*
* Provides the maximum data write lenght of the slave.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* Max write data length.
*
*******************************************************************************/
uint32_t Cy_I3C_SlaveGetMaxWriteLength(I3C_CORE_Type const *base, cy_stc_i3c_context_t const *context)
{
    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != context);
    
    return (uint32_t)_FLD2VAL(I3C_CORE_SLV_MAX_LEN_MWL, I3C_CORE_SLV_MAX_LEN(base));
}


/*******************************************************************************
*  Function Name: Cy_I3C_SlaveGenerateIbi
****************************************************************************//**
*
* Generates the specified IBI on the bus.
*
* \param base
* The pointer to the I3C instance.
*
* \param ibitype
* The pointer to the ibi structure \ref cy_stc_i3c_ibi_t containing the 
* type of ibi event to be generated.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_SlaveGenerateIbi(I3C_CORE_Type *base, cy_stc_i3c_ibi_t *ibitype, cy_stc_i3c_context_t *context)
{
    if((NULL == base) || (NULL == ibitype) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    uint8_t res;
    uint32_t value = 0;
    cy_en_i3c_status_t ret = CY_I3C_SUCCESS;
    
    //Generate a SIR
    if(CY_I3C_IBI_SIR == ibitype->event)
    {
        if(_FLD2VAL(I3C_CORE_SLV_EVENT_STATUS_SIR_EN, I3C_CORE_SLV_EVENT_STATUS(base)))
        {
            //When set, the controller attempts to issue the SIR on the bus. Once set, the applicatio cannot clear this bit
            //SIR_CTRL field of this reg is to be set to 0
            
            Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);
            // Disbale the interrupt signals by clearing the bits
            Cy_I3C_SetInterruptMask(base, 0UL);
            Cy_I3C_SetInterruptStatusMask(base, CY_I3C_INTR_IBI_UPDATED_STS);
            I3C_CORE_SLV_INTR_REQ(base) = I3C_CORE_SLV_INTR_REQ_SIR_Msk;
        }
        else
        {
            //Return that Master has disabled SIR IBI
            return CY_I3C_SIR_DISABLED;
        }
    }

    //Generate a mastership request
    else if((CY_I3C_IBI_MASTER_REQ == ibitype->event) && (CY_I3C_SECONDARY_MASTER == context->i3cMode))
    {    
        //ASK - Should the DEVICE_ROLE be checked here for secondary master??
        if( _FLD2VAL(I3C_CORE_SLV_EVENT_STATUS_MR_EN, I3C_CORE_SLV_EVENT_STATUS(base)))
        {
            
            Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);
            // Disbale the interrupt signals by clearing the bits
            Cy_I3C_SetInterruptMask(base, 0UL);
            Cy_I3C_SetInterruptStatusMask(base, CY_I3C_INTR_IBI_UPDATED_STS);
            //When set, the controller attempts to issue the MR on the bus. Once set, the application cannot clear this bit
            I3C_CORE_SLV_INTR_REQ(base) = I3C_CORE_SLV_INTR_REQ_MR_Msk;
        }
        else
        {
            //Return that Master has disabled MR IBI
            return CY_I3C_MR_DISABLED;
        }
    }

    else
    {
        /*
            When slaves initiates a hot-join ibi genearation event or 
            when a non-secondary master tries requesting for Mastership
        */
        
        return CY_I3C_BAD_EVENT_REQ;
    }
    
    //Handling the response
    do
    {
        //wait till the interrupt of response is received
    }while(0 == (CY_I3C_INTR_IBI_UPDATED_STS & Cy_I3C_GetInterruptStatus(base)));
    
    //Handle the response
    res = (uint8_t)_FLD2VAL(I3C_CORE_SLV_INTR_REQ_IBI_CPLT_STS, I3C_CORE_SLV_INTR_REQ(base));

    if(3 == res)
    {
        /* IBI not attempted, if
        *  1. Master has not assigned the dynamic address
        *  2. Master has cleared the assigned dynamic address
        *  3. Master has disabled the IBI (DISEC)
        *  4. The controller has switched to master mode */
        
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);
        Cy_I3C_SetInterruptMask(base, CY_I3C_SLV_INTR_Msk);
        Cy_I3C_SetInterruptStatusMask(base, CY_I3C_SLV_INTR_Msk);
        ret = CY_I3C_IBI_NOT_ATTEMPTED;
    }
    
    else
    {
        /* IBI is ACKed */
        if(CY_I3C_IBI_MASTER_REQ == ibitype->event)
        {
                /* IBI is acked, check if the mastership is delivered */
                Cy_SysLib_Delay(1000);
    
                value = I3C_CORE_DEVICE_CTRL_EXTENDED(base);

                Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);

                if(0x01 & value)
                {
                    ret = CY_I3C_MR_DISABLED;
                    Cy_I3C_SetInterruptMask(base, CY_I3C_SLV_INTR_Msk);
                    Cy_I3C_SetInterruptStatusMask(base, CY_I3C_SLV_INTR_Msk);
                }

                else
            {
                Cy_I3C_Resume(base, context);
                SecondaryMasterInit(base, true, context);
            }
        }
    }
    return ret;
}


/*******************************************************************************
* Function Name: Cy_I3C_SlaveConfigReadBuf
****************************************************************************//**
*
* Configures the buffer pointer and the read buffer size. This is the buffer
* from which the master reads data. After this function is called, data
* transfer from the read buffer to the master is handled by
* \ref Cy_I3C_Interrupt.
*
* When the Read transaction is completed \ref CY_I3C_SLAVE_WR_CMPLT is set.
* Also the \ref CY_I3C_SLAVE_WR_CMPLT_EVENT event is generated.
*
* \param base
* The pointer to the I3C instance.
*
* \param buffer
* The pointer to the buffer with data to be read by the master.
*
* \param size
* Size of the buffer.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
void Cy_I3C_SlaveConfigReadBuf (I3C_CORE_Type const *base, uint8_t *buffer, uint32_t size, cy_stc_i3c_context_t *context)
{
     CY_ASSERT_L1(NULL != base);
     CY_ASSERT_L1(NULL != context);
     CY_ASSERT_L1(CY_IS_I3C_BUFFER_VALID(buffer, size));
    
    /* Suppress a compiler warning about unused variables */
    (void) base;

    context->slaveTxBuffer     = buffer;
    context->slaveTxBufferSize = size;
    context->slaveTxBufferIdx  = 0UL;
    context->slaveTxBufferCnt  = 0UL;
}


