ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/source/cy_i3c.c
/*******************************************************************************
* Function Name: Cy_I3C_SlaveGetReadTransferCount
****************************************************************************//**
*
* Returns the number of bytes read by the master since the last time
* \ref Cy_I3C_SlaveConfigReadBuf was called.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* The number of bytes read by the master.
*
*******************************************************************************/
uint32_t Cy_I3C_SlaveGetReadTransferCount (I3C_CORE_Type const *base, cy_stc_i3c_context_t const *context)
{
    CY_ASSERT_L1(NULL != base);
    
    /* Suppress a compiler warning about unused variables */
    (void)base;
    
    return (context->slaveTxBufferCnt);
}

//TBD - Check RD/WR macro from I2C
/*******************************************************************************
* Function Name: Cy_I3C_SlaveConfigWriteBuf
****************************************************************************//**
*
* Configures the buffer pointer and the write buffer size. This is the buffer
* that the master writes data to. After this function is called, data
* transfer from the master into the write buffer is handled by
* \ref Cy_I3C_Interrupt.
*
* When the write transaction is completed \ref CY_I3C_SLAVE_RD_CMPLT is set.
* Also the \ref CY_I3C_SLAVE_RD_CMPLT_EVENT event is generated.
*
* \param base
* The pointer to the I3C instance.
*
* \param buffer
* The pointer to buffer to store data written by the master.
*
* \param size
* Size of the buffer.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
void Cy_I3C_SlaveConfigWriteBuf(I3C_CORE_Type const *base, uint8_t *buffer, uint32_t size, cy_stc_i3c_context_t *context)
{
    CY_ASSERT_L1(NULL != base);
    CY_ASSERT_L1(NULL != context);
    CY_ASSERT_L1(CY_IS_I3C_BUFFER_VALID(buffer, size));

    /* Suppress a compiler warning about unused variables */
    (void) base;

    context->slaveRxBuffer     = buffer;
    context->slaveRxBufferSize = size;
    context->slaveRxBufferIdx  = 0UL;
}


/*******************************************************************************
* Function Name: Cy_I3C_SlaveGetWriteTransferCount
****************************************************************************//**
*
* Returns the number of bytes written by the master since the last time
* \ref Cy_I3C_SlaveConfigWriteBuf was called.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* The number of bytes written by the master.
*
*******************************************************************************/
uint32_t Cy_I3C_SlaveGetWriteTransferCount (I3C_CORE_Type const *base, cy_stc_i3c_context_t const *context)
{
    CY_ASSERT_L1(NULL != base);
    
    /* Suppress a compiler warning about unused variables */
    (void) base;

    return (context->slaveRxBufferCnt);
}


/*******************************************************************************
* Function Name: Cy_I3C_DeliverMastership
****************************************************************************//**
* Delivers the bus mastership to the requesting secondary master.
*
* \param base
* The pointer to the I3C instance.
*
* \param SecMasterAddress
* The address of the I3C device to which the mastership has to be delivered.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \note
* This should be called by the user when a mastership request IBI is received 
* through cy_cb_i3c_handle_ibi_t callback and user wants to deliver master ship.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_DeliverMastership(I3C_CORE_Type *base, uint8_t SecMasterAddress, cy_stc_i3c_context_t *context)
{
    if((NULL == base) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }
    cy_stc_i3c_ccc_cmd_t cccCmd;
    cy_stc_i3c_ccc_getaccmst_t getaccmst;
    cy_stc_i3c_ccc_payload_t payload;
    uint8_t addr;
    cy_en_i3c_status_t errorStatus;
    
    addr = SecMasterAddress;

    cccCmd.address = addr; //Check this slave address
    cccCmd.cmd = CY_I3C_CCC_GETACCMST;
    cccCmd.data = &payload;
    cccCmd.data->data = &(getaccmst.newmaster);
    
    errorStatus = getaccmst_ccc(base, &cccCmd, context);

    if(CY_I3C_SUCCESS == errorStatus)
    {
        if(addr != (getaccmst.newmaster >> 1))
        {
            errorStatus = CY_I3C_ADDR_MISMATCH;
        }

        else
        {
            //Mastership is transferred and the controller is in the Slave Mode

            uint32_t value;

            value = _FLD2VAL(I3C_CORE_DEVICE_CTRL_EXTENDED_DEV_OPERATION_MODE,I3C_CORE_DEVICE_CTRL_EXTENDED(base));

            if(value)
            {
                //Mode is changed to slave
                cy_en_i3c_status_t  status;

                Cy_I3C_Resume(base, context);
                I3C_CORE_RESET_CTRL(base) |= (I3C_CORE_RESET_CTRL_IBI_QUEUE_RST_Msk | I3C_CORE_RESET_CTRL_SOFT_RST_Msk);
                status = SecondaryMasterInit(base, false, context);

