ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/source/cy_i3c.c
                return status;
            }
            
        }
    }
    return errorStatus;
}


/*******************************************************************************
* Function Name: Cy_I3C_RequestMastership
****************************************************************************//**
*
* Requests mastership from the current master.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
cy_en_i3c_status_t Cy_I3C_RequestMastership(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    if((NULL == base) || (NULL == context))
    {
        return CY_I3C_BAD_PARAM;
    }

    if(CY_I3C_SECONDARY_MASTER != context->i3cMode)
    {
        return CY_I3C_NOT_SECONDARY_MASTER;
    }

    cy_en_i3c_status_t retStatus;
    cy_stc_i3c_ibi_t ibi;

    retStatus = Cy_I3C_SlaveGetDynamicAddress(base, &(ibi.slaveAddress), context);

    if(CY_I3C_SUCCESS == retStatus)
    {
        ibi.event = CY_I3C_IBI_MASTER_REQ;
        retStatus = Cy_I3C_SlaveGenerateIbi(base, &ibi, context);
    }

    return retStatus;
}

/*******************************************************************************
* Function Name: SecondaryMasterInit
****************************************************************************//**
*
* This function does the basic Master Mode configurations when the operation
* mode of the Secondary Master is changed from I3C Slave to I3C Master.
*
* \param base
* The pointer to the I3C instance.
*
* \isMaster
* true: Master mode initializations.
* false: Slave mode initializations.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
cy_en_i3c_status_t SecondaryMasterInit(I3C_CORE_Type *base, bool isMaster, cy_stc_i3c_context_t *context)
{
    if(isMaster)
    {
        cy_stc_i3c_master_t *i3cMaster = &(context->i3cMaster);
        uint8_t address, idx; 
        uint32_t value;
        uint32_t staticAddress, dynamicAddress, bcr, dcr, i2c;
        cy_stc_i3c_device_t i3cDevice;
        cy_stc_i2c_device_t i2cDevice;
        
        i3cMaster->freePos = 0x7FFUL;
        i3cMaster->lastAddress = 0;
        i3cMaster->devCount = 0;
        i3cMaster->i2cDeviceCount = 0;
        i3cMaster->dynAddrDevCount = 0;
    
            address = _FLD2VAL(I3C_CORE_DEVICE_ADDR_DYNAMIC_ADDR, I3C_CORE_DEVICE_ADDR(base));

        InitAddrslots(context);
        SetAddrslotStatus(address, CY_I3C_ADDR_SLOT_I3C_DEV, context);
        
        Cy_I3C_SetDataRate(base, context->i3cSclRate, context->i3cClockHz, context); 
    
        Cy_I3C_SetInterruptMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
        Cy_I3C_SetInterruptStatusMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);

        for(idx = 0; idx < context->slaveRxBufferCnt; idx++)
        {
            dynamicAddress = I3C_CORE_DEV_CHAR_TABLE1_LOC1(base) & 0xFFUL;
            staticAddress = (I3C_CORE_DEV_CHAR_TABLE1_LOC1(base) & 0xFF000000UL) >> 24;
            dcr = (I3C_CORE_DEV_CHAR_TABLE1_LOC1(base) & 0xFF00UL) >> 8;
            bcr = (I3C_CORE_DEV_CHAR_TABLE1_LOC1(base) & 0xFF0000UL) >> 16;

            i2c = dynamicAddress? 0 : 1;

            value = _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_DYNAMIC_ADDR, dynamicAddress) |
                    _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_STATIC_ADDR, staticAddress) |
                    _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC10_LEGACY_I2C_DEVICE, i2c);
            
            Cy_I3C_WriteIntoDeviceAddressTable(base, idx, value);

            if(i2c)
            {
                /* I2C Device */
                SetAddrslotStatus(staticAddress, CY_I3C_ADDR_SLOT_I2C_DEV, context);
                i2cDevice.lvr = dcr;
                i2cDevice.staticAddress = staticAddress;

                Cy_I3C_UpdateI2CDevInList(&i2cDevice, idx, context);
    
                (i3cMaster->freePos) = ~ (CY_I3C_BIT(idx));
                (i3cMaster->devCount)++;
                (i3cMaster->i2cDeviceCount)++;
            }
            else
            {
                /* I3C Device */
                SetAddrslotStatus(dynamicAddress, CY_I3C_ADDR_SLOT_I3C_DEV, context);

                i3cDevice.bcr = bcr;
                i3cDevice.dcr = dcr;
                i3cDevice.dynamicAddress = dynamicAddress;
                RetrieveI3CDeviceInfo(base, &i3cDevice, false, context);
                i3cDevice.staticAddress = 0;
                Cy_I3C_UpdateI3CDevInList(&i3cDevice, idx, context);

                i3cMaster->freePos &= ~(CY_I3C_BIT(idx));
                (i3cMaster->devCount)++;
            }
        }
    }

    else
    {
        I3C_CORE_SLV_EVENT_STATUS(base) &= (~I3C_CORE_SLV_EVENT_STATUS_HJ_EN_Msk);
        
        //Sets the number of entries in the Receive FIFO that trigger the interrupt to 1 word
        I3C_CORE_DATA_BUFFER_THLD_CTRL(base) &= _VAL2FLD(I3C_CORE_DATA_BUFFER_THLD_CTRL_RX_BUF_THLD, 5) |
                                                _VAL2FLD(I3C_CORE_DATA_BUFFER_STATUS_LEVEL_TX_BUF_EMPTY_LOC, 1);

        Cy_I3C_SetInterruptMask(base, CY_I3C_SLV_INTR_Msk | CY_I3C_INTR_DEFSLV_STS);
        Cy_I3C_SetInterruptStatusMask(base, CY_I3C_SLV_INTR_Msk | CY_I3C_INTR_DEFSLV_STS);
    }
    
    return CY_I3C_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_I3C_SlaveInterrupt
****************************************************************************//**
*
* This is the interrupt function for the I3C configured in slave mode.
* This function should be called inside the user-defined interrupt service routine.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
void Cy_I3C_SlaveInterrupt (I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    uint32_t intrCause;
    intrCause = Cy_I3C_GetInterruptStatus(base);

