ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/source/cy_i3c.c
    if(0 != (CY_I3C_INTR_TX_BUFFER_THLD_STS & intrCause))
    {
        SlaveHandleDataTransmit(base, context);
    }

    if(0 != (CY_I3C_INTR_RX_BUFFER_THLD_STS & intrCause))//TBD - Add callbacks
    {
    //TBD - Check if the Rx buffer is configured or not
        SlaveHandleDataReceive(base, context);
    }

    if(0 != (CY_I3C_INTR_RESP_READY_STS & intrCause))
    {
        SlaveRespReadyStsHandle(base, context);
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_RESP_READY_STS);
    }

    if(0 != (CY_I3C_INTR_CCC_UPDATED_STS & intrCause))
    {
        if(_FLD2VAL(I3C_CORE_SLV_EVENT_STATUS_MRL_UPDATED, I3C_CORE_SLV_EVENT_STATUS(base)))
        {
            context->cbEvents(CY_I3C_SLAVE_MAX_RD_LEN_UPDT_EVENT);
            I3C_CORE_SLV_EVENT_STATUS(base) |= I3C_CORE_SLV_EVENT_STATUS_MRL_UPDATED_Msk;
        }
        else if(_FLD2VAL(I3C_CORE_SLV_EVENT_STATUS_MWL_UPDATED, I3C_CORE_SLV_EVENT_STATUS(base)))
        {
            context->cbEvents(CY_I3C_SLAVE_MAX_WR_LEN_UPDT_EVENT);
            I3C_CORE_SLV_EVENT_STATUS(base) |= I3C_CORE_SLV_EVENT_STATUS_MWL_UPDATED_Msk;
        }
        else
        {
            context->cbEvents(CY_I3C_SLAVE_CCC_REG_UPDATED_EVENT);
        }
        
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_CCC_UPDATED_STS);
    }

    if(0 != (CY_I3C_INTR_DYN_ADDR_ASSGN_STS & intrCause))
    {
        context->cbEvents(CY_I3C_SLAVE_ASSIGNED_DYN_ADDR_EVENT);
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_DYN_ADDR_ASSGN_STS);
    }

    /* Read request from the master */
    if(0 != (CY_I3C_INTR_READ_REQ_RECV_STS & intrCause))
    {
        if(NULL != (context->cbEvents))
        {
            //Callback - in case of error 
            
            uint32_t event;
            event = CY_I3C_SLAVE_NO_VALID_CMD_IN_CMDQ_EVENT;
            if(_FLD2VAL(I3C_CORE_CCC_DEVICE_STATUS_DATA_NOT_READY, I3C_CORE_CCC_DEVICE_STATUS(base)))
            {
                event |= CY_I3C_SLAVE_DATA_NOT_READY_EVENT;
            }
            context->cbEvents(event);
        }
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK); 
    }

    if(0 != (CY_I3C_INTR_BUSOWNER_UPDATED_STS & intrCause))
    {
        if(NULL != (context->cbEvents))
        {
            //Callback - in case of error 
            context->cbEvents(CY_I3C_CONTROLLER_ROLE_UPDATED_EVENT);
        }
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK); 
        return;
    }

    if(0 != (CY_I3C_INTR_DEFSLV_STS & intrCause))
    {
        uint32_t idx;
        idx = context->slaveRxBufferCnt;

        I3C_CORE_DEV_CHAR_TABLE_POINTER(base) |= _VAL2FLD(I3C_CORE_DEV_CHAR_TABLE_POINTER_PRESENT_DEV_CHAR_TABLE_INDX,idx);
        if(NULL != (context->cbEvents))
        {
            //Callback - in case of error 
            context->cbEvents(CY_I3C_DEFSLV_EVENT);
        }
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK); 
        return;
    }
}


/*******************************************************************************
* Function Name: Cy_I3C_MasterInterrupt
****************************************************************************//**
*
* This is the interrupt function for the I3C configured in master mode.
* This function should be called inside the user-defined interrupt service routine.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
void Cy_I3C_MasterInterrupt (I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    uint32_t intrCause;
    intrCause = Cy_I3C_GetInterruptStatus(base);

    if(0 != (CY_I3C_INTR_RESP_READY_STS & intrCause))
    {
        if(0 != (CY_I3C_INTR_TRANSFER_ERR_STS & intrCause))
        {
            uint32_t respCmdPort, errorEvent;
            respCmdPort = I3C_CORE_RESPONSE_QUEUE_PORT(base);
            errorEvent = ResponseErrorEvent(respCmdPort); 
            context->masterStatus |= CY_I3C_MASTER_HALT_STATE;
            context->masterStatus &= (~CY_I3C_MASTER_BUSY);
            context->state = CY_I3C_IDLE;
            
            if(NULL != (context->cbEvents))
            {
                //Callback - in case of error 
                context->cbEvents(errorEvent);
            }
            Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK); //Check if this clearing in not harmful
            Cy_I3C_SetInterruptMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
            Cy_I3C_SetInterruptStatusMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
            return;
        }
        
        else
        {    
            MasterRespReadyStsHandle(base, context);
        }

        Cy_I3C_SetInterruptMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
        Cy_I3C_SetInterruptStatusMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
        return;
    }

    if(0 != (CY_I3C_INTR_TRANSFER_ABORT_STS & intrCause))
    {
        //Test - Check: Does this set the TRANSFER_ERROR_STS and the error field too?
        
        context->masterStatus |= CY_I3C_MASTER_XFER_ABORTED | CY_I3C_MASTER_HALT_STATE;
        context->masterStatus &= (~CY_I3C_MASTER_BUSY);
        context->state = CY_I3C_IDLE;

        I3C_CORE_RESET_CTRL(base) = I3C_CORE_RESET_CTRL_SOFT_RST_Msk;

        if(NULL != context->cbEvents)
        {
            context->cbEvents(CY_I3C_XFER_ABORTED_ERROR_EVENT);
        }

        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);
        Cy_I3C_SetInterruptMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
        Cy_I3C_SetInterruptStatusMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
        
        return;
    }

    if(0 != (CY_I3C_INTR_IBI_BUFFER_THLD_STS & intrCause))
    {
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);

        MasterHandleIBIInterrupt(base, context);

        return;
    }
    
    if(0 != (CY_I3C_INTR_BUSOWNER_UPDATED_STS & intrCause))
    {
        if(NULL != (context->cbEvents))
        {
            //Callback - in case of error 
            context->cbEvents(CY_I3C_CONTROLLER_ROLE_UPDATED_EVENT);
        }
        Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK); 
        return;
    }

