ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/source/cy_i3c.c
/*******************************************************************************
*  Function Name: GetI2CDevAddrPos
****************************************************************************//**
*
* Obtains the position of the I2C device with the specified static address
* in the DAT.
*
* \param base
* The pointer to the I3C instance.
*
* \param staticAddress
* The static address of the I2C device.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* Position of the I2C device in the DAT.
* 
*******************************************************************************/
static uint32_t GetI2CDevAddrPos(I3C_CORE_Type *base, uint8_t staticAddress, cy_stc_i3c_context_t *context)
{
    uint8_t index;
    for(index = 0; index < CY_I3C_MAX_DEVS; index++)
    {
        if(staticAddress == Cy_I3C_ReadStaticAddrFromDAT(base, index))
            return index;
    }

    return CY_I3C_BAD_PARAM;
}

/*******************************************************************************
*  Function Name: GetI3CDevAddrPos
****************************************************************************//**
*
* Obtains the position of the I3C device with the specified dynamic address
* in the DAT.
*
* \param base
* The pointer to the I3C instance.
*
* \param dynamicAddress
* The dynamic address of the I3C device.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* Position of the I3C device in the DAT.
*
*******************************************************************************/
static uint32_t GetI3CDevAddrPos(I3C_CORE_Type *base, uint8_t dynamicAddress, cy_stc_i3c_context_t *context)
{
    uint8_t index;
    for(index = 0; index < CY_I3C_MAX_DEVS; index++)
    {
        uint32_t ret;
        ret = Cy_I3C_ReadDynAddrFromDAT(base, index);
        if(dynamicAddress == ret)
            return index;
    }

    return CY_I3C_BAD_PARAM;
}

/*******************************************************************************
*  Function Name: GetDATFreePos
****************************************************************************//**
*
* Obtains the position of free location in the DAT.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return 
* Position of the free location in the DAT.
*
*******************************************************************************/
static uint32_t GetDATFreePos(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    uint32_t ret;
    ret = ffs(context->i3cMaster.freePos) - 1;

    return ret;
}

/*******************************************************************************
*  Function Name: GetAaddrslotStatus
****************************************************************************//**
*
* Obtains the status of the address parameter.
*
* \param address
* 7-bit right justified address.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return 
* \ref cy_en_i3c_addr_slot_status_t.
*
*******************************************************************************/
static cy_en_i3c_addr_slot_status_t GetAaddrslotStatus(uint8_t address, cy_stc_i3c_context_t *context)
{
    cy_stc_i3c_master_t *i3cMaster = &(context->i3cMaster);
    int status, bitPos = address * 2;

    if (address > CY_I3C_MAX_ADDR)
        return CY_I3C_ADDR_SLOT_RSVD;

    status = i3cMaster->addrslotsStatusArray[bitPos / CY_I3C_BITS_PER_LONG];
    status >>= bitPos % CY_I3C_BITS_PER_LONG;

    return (cy_en_i3c_addr_slot_status_t)(status & CY_I3C_ADDR_SLOT_STATUS_MASK);
}

/*******************************************************************************
*  Function Name: ResponseError
****************************************************************************//**
*
* Provides the error type recieved in the response status.
*
* \param respCmd.
* The value read from the response queue port register 
*
* \return 
* \ref cy_en_i3c_status_t.

*******************************************************************************/
static cy_en_i3c_status_t ResponseError(uint32_t respCmd)
{
    uint8_t error;
    error = _FLD2VAL(I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_ERR_STS, respCmd);
    int ret = 0U;//DOUBT - What should be the default return value?
    
    switch (error)
    {
        case 1: ret = CY_I3C_MASTER_CRC_ERROR; break;
        case 2: ret = CY_I3C_MASTER_PARITY_ERROR; break;
        case 3: ret = CY_I3C_MASTER_FRAME_ERROR; break;
        case 4: ret = CY_I3C_MASTER_BROADCAST_ADDR_NACK_ERROR; break;
        case 5: ret = CY_I3C_MASTER_ADDR_NACK_ERROR; break; //This is same as ERROR M2
        case 6: ret = CY_I3C_MASTER_BUFFER_OVERFLOW_ERROR; break;
        case 8: ret = CY_I3C_MASTER_XFER_ABORTED_ERROR; break;
        case 9: ret = CY_I3C_MASTER_I2C_SLV_WDATA_NACK_ERROR; break;
        default: /* Unknow Error */ break;
    }
    return (cy_en_i3c_status_t)ret;
}

/*******************************************************************************
*  Function Name: ResponseErrorEvent
****************************************************************************//**
*
* Provides error events to be passed by \ref cy_cb_i3c_handle_events_t callback
* based on the type of error type received in the response status.
*
* \param respCmd.
* The value read from the response queue port register.
*
* \return 
* \ref group_i3c_macros_callback_events.

******************************************************************************/
static uint32_t ResponseErrorEvent(uint32_t respCmd)
{
    uint8_t error;
    error = _FLD2VAL(I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_ERR_STS, respCmd);
    uint32_t ret = 0; //DOUBT - What should be the default return value?
    
    switch (error)
    {
        case 1: ret = CY_I3C_CRC_ERROR_EVENT; break;
        case 2: ret = CY_I3C_PARITY_ERROR_EVENT; break;
        case 3: ret = CY_I3C_FRAME_ERROR_EVENT; break;
        case 4: ret = CY_I3C_BROADCAST_ADDR_NACK_ERROR_EVENT; break;
        case 5: ret = CY_I3C_ADDR_NACK_ERROR_EVENT; break;
        case 6: ret = CY_I3C_BUFFER_OVERFLOW_ERROR_EVENT; break;
        case 8: ret = CY_I3C_XFER_ABORTED_ERROR_EVENT; break;
        case 9: ret = CY_I3C_I2C_SLV_WDATA_NACK_ERROR_EVENT; break;
        case 10: ret = CY_I3C_MASTER_EARLY_TERMINATION_EVENT; break;
        default: /* Unknown Error */ break;

