ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/source/cy_i3c.c
    }
    return ret;
}

/*******************************************************************************
* Function Name: WriteArray
****************************************************************************//**
*
* Places an array of data in the transmit FIFO.
* This function does not block. It returns how many data elements were
* placed in the transmit FIFO.
*
* \param base
* The pointer to the I3C instance.
*
* \param buffer
* The pointer to data to place in the transmit FIFO.
*
* \param size
* The number of data elements to transmit.
*
*******************************************************************************/
static void WriteArray(I3C_CORE_Type *base, void *buffer, uint32_t size)
{
    uint32_t *buf = buffer;
    uint32_t index;

    /*Put data in TX FIFO */
    for(index = 0UL; index < (size/4); ++index)
    {
        Cy_I3C_WriteTxFIFO(base, *(buf + index));
    }

    if(size & 3)
    {
        uint8_t cnt = size & 3;
        uint8_t *ptr;
        uint32_t value = 0UL;
        
        ptr = (uint8_t *)(buf + index);
        
        for(index = 0; index < cnt; index++)
        {
            value |= (*ptr) << (index * 8);
            ptr++;
        }
        Cy_I3C_WriteTxFIFO(base, value);
    }
}


/*******************************************************************************
* Function Name: ReadArray
****************************************************************************//**
*
* Reads an array of data out of the receive FIFO.
* This function does not block.
*
* \param base
* The pointer to the I3C instance.
*
* \param buffer
* The pointer to location to place data read from receive FIFO.
*
* \param size
* The number of data elements to read from the receive FIFO.
*
*******************************************************************************/
static void ReadArray(I3C_CORE_Type *base, void *buffer, uint32_t size)
{
    uint32_t index;
    uint32_t *buf = buffer;
    
    for(index = 0UL; index < size/4; ++index)
    {
        *(buf + index) = Cy_I3C_ReadRxFIFO(base);
    }

    if(size & 3)
    {
        *(buf + index) = Cy_I3C_ReadRxFIFO(base);
    }
}

/*******************************************************************************
* Function Name: MasterHandleDataTransmit
****************************************************************************//**
*
* Loads TX FIFO with data provided by \ref Cy_I3C_MasterWrite.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
static void MasterHandleDataTransmit(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
        if (context->masterBufferSize > 1UL)
        {
            /* Get the number of bytes to copy into TX FIFO */
            uint32_t numToCopy = context->masterBufferSize;

            /* Write data into TX FIFO */
            WriteArray(base, context->masterBuffer, numToCopy);
        }
}

/*******************************************************************************
* Function Name: MasterHandleDataReceive
****************************************************************************//**
*
* Reads data from RX FIFO into the buffer provided by \ref Cy_I3C_MasterRead.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
static void MasterHandleDataReceive(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    uint32_t numToRead;
    numToRead = context->masterBufferSize;
    //Read from the RX FIFO
    ReadArray(base, context->masterBuffer, numToRead);
}


/*******************************************************************************
*  Function Name: RetrieveI3CDeviceInfo
****************************************************************************//**
*
* To retrieve device information which includes: max write len, max read len,
* max data speed, HDR capability, BCR, DCR and PID.
*
* \param base
* The pointer to the I3C instance.
* 
* \param i3cDevice
* The pointer to the I3C device description structure \ref cy_stc_i3c_device_t.
*
* \basicInfo
* true: obtains BCR, DCR and PID of the device
* false: otherwise
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static void RetrieveI3CDeviceInfo(I3C_CORE_Type *base, cy_stc_i3c_device_t *i3cDevice, bool basicInfo, cy_stc_i3c_context_t *context)
{
    cy_stc_i3c_ccc_cmd_t cccCmd;
    cy_stc_i3c_ccc_payload_t payload;
    cccCmd.address = i3cDevice->dynamicAddress;
    cccCmd.data = &payload;
    
    if(true == basicInfo)
    {
        cy_stc_i3c_ccc_getbcr_t bcr;
        cccCmd.data->data = &bcr;
        cccCmd.cmd = CY_I3C_CCC_GETBCR;
        Cy_I3C_SendCCCCmd(base, &cccCmd, context);
        i3cDevice->bcr = bcr.bcr;

        cy_stc_i3c_ccc_getdcr_t dcr;
        cccCmd.data->data = &dcr;
        cccCmd.cmd = CY_I3C_CCC_GETDCR;
        Cy_I3C_SendCCCCmd(base, &cccCmd, context);
        i3cDevice->dcr = dcr.dcr;

        cy_stc_i3c_ccc_getpid_t pid;
        cccCmd.data->data = &pid;
        cccCmd.cmd = CY_I3C_CCC_GETPID;
        Cy_I3C_SendCCCCmd(base, &cccCmd, context);
        
        uint8_t *ptr;
        uint8_t cnt, shift;
        ptr = pid.pid;
        i3cDevice->provisonalID = 0;

        for(cnt = 0; cnt < sizeof(pid); cnt++)
        {    
            shift = (sizeof(pid) - cnt - 1) * 8;
            (i3cDevice->provisonalID) |= ((uint64_t)(*ptr)) << shift;
            ptr++;
        }
    }

    //Get max read len
    cy_stc_i3c_ccc_mrwl_t mrwl;
    cccCmd.data->data = &mrwl;
    cccCmd.cmd = CY_I3C_CCC_GETMRL;
    Cy_I3C_SendCCCCmd(base, &cccCmd, context);
    
    i3cDevice->mrl = mrwl.len;

    //Get max write len
    cccCmd.cmd = CY_I3C_CCC_GETMWL;
    Cy_I3C_SendCCCCmd(base, &cccCmd, context);
    i3cDevice->mwl = mrwl.len;

    if(0 != (CY_I3C_CORE_BCR_MAX_DATA_SPEED_LIM_Msk & (i3cDevice->bcr)))
    {
        cy_stc_i3c_ccc_getmxds_t mxds;
        i3cDevice->speedLimit = true;
        cccCmd.data->data = &mxds;
        cccCmd.cmd = CY_I3C_CCC_GETMXDS;
        Cy_I3C_SendCCCCmd(base, &cccCmd, context);
        i3cDevice->maxReadDs = mxds.maxrd;
        i3cDevice->maxWriteDs = mxds.maxwr;
        i3cDevice->maxReadTurnaround[0] = mxds.maxrdturn[0];
        i3cDevice->maxReadTurnaround[1] = mxds.maxrdturn[1];
        i3cDevice->maxReadTurnaround[2] = mxds.maxrdturn[2];
    }

    else
    {
        i3cDevice->speedLimit = false;
    }

    if(0!= (CY_I3C_CORE_BCR_HDR_CAP_Msk & (i3cDevice->bcr)))
    {
        cy_stc_i3c_ccc_gethdrcap_t hdrcap;
        i3cDevice->hdrSupport = true;
        cccCmd.data->data = &hdrcap;
        cccCmd.cmd = CY_I3C_CCC_GETHDRCAP;
        Cy_I3C_SendCCCCmd(base, &cccCmd, context);
        i3cDevice->HDRCap = hdrcap.modes;
    }

    else
    {
        i3cDevice->hdrSupport = false;
    }

