ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/source/cy_i3c.c
/*******************************************************************************
*  Function Name: enec_disec_ccc
****************************************************************************//**
*
* Enable/Disable Slave Events Command.
*
* \param base
* The pointer to the I3C instance.
* 
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t enec_disec_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus;
    
    retStatus = CCCSlaveAddressValidation(cccCmd->address, false, context);

    if(retStatus != CY_I3C_SUCCESS)
        return retStatus;
        
    /* Expects 1 byte of data */
    if(0 == cccCmd->data->len)
        return CY_I3C_BAD_PARAM;

    CCC_Set(base, cccCmd, context);

    retStatus = MasterHandleCCCResponse(base, NULL, context);

    return retStatus;
}

/*******************************************************************************
*  Function Name: rstdaa_ccc
****************************************************************************//**
*
* Reset Dynamic Address Assignment Command.
*
* \param base
* The pointer to the I3C instance.
* 
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t rstdaa_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus;
    uint32_t pos = 0;
    
    retStatus = CCCSlaveAddressValidation(cccCmd->address, false, context);

    if(retStatus != CY_I3C_SUCCESS)
        return retStatus;

    CCC_Set(base, cccCmd, context);

    retStatus = MasterHandleCCCResponse(base, NULL, context);

    if(CY_I3C_SUCCESS != retStatus)
        return retStatus;
    
    //handling of unicast command
    if(CY_I3C_BROADCAST_ADDR != cccCmd->address)
    {
        pos = GetI3CDevAddrPos(base, cccCmd->address, context);

        Cy_I3C_WriteIntoDeviceAddressTable(base, pos, 0);
        
        context->i3cMaster.freePos |= CY_I3C_BIT(pos);
        context->i3cMaster.devCount--;

        SetAddrslotStatus(cccCmd->address, CY_I3C_ADDR_SLOT_FREE, context);
    }

    //handling of broadcast command
    else
    {
        for(pos = 0; pos < (context->i3cMaster.devCount); pos++)
        {
            Cy_I3C_WriteIntoDeviceAddressTable(base, pos, 0);

            context->i3cMaster.freePos |= CY_I3C_BIT(pos);
            context->i3cMaster.devCount--;
        }

        DeInitAddrslots(context);
        
    }
    
    return CY_I3C_SUCCESS;
}

/*******************************************************************************
*  Function Name: setmrwl_ccc
****************************************************************************//**
*
* Set Maximum Read/Write Length Command.
*
* \param base
* The pointer to the I3C instance.
* 
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t setmrwl_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    uint8_t pos, idx;
    cy_en_i3c_status_t retStatus;
    uint16_t *data;

    retStatus = CCCSlaveAddressValidation(cccCmd->address, false, context);

    if(retStatus != CY_I3C_SUCCESS)
        return retStatus;
    
    /* Expects 2 byte of data */
    if(0 == cccCmd->data->len)
        return CY_I3C_BAD_PARAM;

    CCC_Set(base, cccCmd, context);

    retStatus = MasterHandleCCCResponse(base, NULL, context);

    if(CY_I3C_SUCCESS != retStatus)
        return retStatus;

    if( CY_I3C_CCC_SETMRL(false) == cccCmd->cmd) //Set maximum read length for the target device
    {
        pos = GetI3CDevAddrPos(base, cccCmd->address, context);
        data = (uint16_t *)(cccCmd->data->data);
        context->devList[pos].i3cDevice.mrl = *data;
    }

    else if(CY_I3C_CCC_SETMWL(false) == cccCmd->cmd) //Set maximum write length for the target device
    {
        pos = GetI3CDevAddrPos(base, cccCmd->address, context);
        data = (uint16_t *)(cccCmd->data->data);
        context->devList[pos].i3cDevice.mwl = *data;
    }

    else if(CY_I3C_CCC_SETMRL(true) == cccCmd->cmd) //Set maximum read length for all the slave I3C devices - broadcast command
    {
        cy_stc_i3c_master_devlist_t *devList = context->devList;
        for(idx = 0; idx < (Cy_I3C_GetI3CDeviceCount(base, context)); idx++)
        {
            if(!devList->i2c)
            {
                data = (uint16_t *)(cccCmd->data->data);
                devList->i3cDevice.mrl = *data;
            }
            devList++;
        }
    }

    else //Set maximum write length for all the slave I3C devices - broadcast command
    {
        cy_stc_i3c_master_devlist_t *devList = context->devList;
        for(idx = 0; idx < (Cy_I3C_GetI3CDeviceCount(base, context)); idx++)
        {
            if(!devList->i2c)
            {
                data = (uint16_t *)(cccCmd->data->data);
                devList->i3cDevice.mwl = *data;
            }
            devList++;
        }
    }
    
    context->masterStatus &= (~CY_I3C_MASTER_BUSY);
    return CY_I3C_SUCCESS;

