ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/source/cy_i3c.c
    retStatus = MasterHandleCCCResponse(base, &respCmdPort, context);

    if(CY_I3C_SUCCESS != retStatus)
        return retStatus;

/*    if(sizeof(*getbcr) != (respCmdPort & I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk))
        return CY_I3C_MASTER_ERROR_M0; //ERROR_M0 - Illegally formatted CCC */
        

    //Read data from the FIFO to the data_field of the cmd structure
    data = Cy_I3C_ReadRxFIFO(base);

    getbcr = (cy_stc_i3c_ccc_getbcr_t *)cccCmd->data->data;
    getbcr->bcr = data;

    return CY_I3C_SUCCESS;
}

/*******************************************************************************
*  Function Name: getdcr_ccc
****************************************************************************//**
*
* Get Bus Characteristic Register Command.
*
* \param base
* The pointer to the I3C instance.
* 
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t getdcr_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus;
    uint32_t respCmdPort = 0;
    uint8_t data;
    cy_stc_i3c_ccc_getdcr_t *getdcr;
    
    retStatus = CCCSlaveAddressValidation(cccCmd->address, true, context);

    if(retStatus != CY_I3C_SUCCESS)
        return retStatus;
    
    cccCmd->data->len = sizeof(*getdcr); //Expects 1 byte of data
    
    CCC_Get(base, cccCmd, context);

    retStatus = MasterHandleCCCResponse(base, &respCmdPort, context);

    if(CY_I3C_SUCCESS != retStatus)
        return retStatus;

    /*if(sizeof(*getdcr) != (respCmdPort & I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk))
        return CY_I3C_MASTER_ERROR_M0; //ERROR_M0 - Illegally formatted CCC */
        
    //Read data from the FIFO to the data_field of the cmd structure
    data = Cy_I3C_ReadRxFIFO(base);

    getdcr = (cy_stc_i3c_ccc_getdcr_t *)cccCmd->data->data;
    getdcr->dcr = data;

    return CY_I3C_SUCCESS;
}

/*******************************************************************************
*  Function Name: getstatus_ccc
****************************************************************************//**
*
* Get Devie Status Command.
*
* \param base
* The pointer to the I3C instance.
* 
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t getstatus_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus;
    uint32_t respCmdPort = 0;
    uint16_t data;
    cy_stc_i3c_ccc_getstatus_t *getStatus;
    
    retStatus = CCCSlaveAddressValidation(cccCmd->address, true, context);

    if(retStatus != CY_I3C_SUCCESS)
        return retStatus;

    cccCmd->data->len = sizeof(*getStatus); //Expects 2 bytes of data
    
    CCC_Get(base, cccCmd, context);

    retStatus = MasterHandleCCCResponse(base, &respCmdPort, context);

    if(CY_I3C_SUCCESS != retStatus)
        return retStatus;

/*    if(sizeof(*getStatus) != (respCmdPort & I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk))
        return CY_I3C_MASTER_ERROR_M0; //ERROR_M0 - Illegally formatted CCC */

    //Read data from the FIFO to the data_field of the cmd structure
    data = Cy_I3C_ReadRxFIFO(base);
    data = CY_I3C_SWAP16(data);

    getStatus = (cy_stc_i3c_ccc_getstatus_t *)cccCmd->data->data;
    getStatus->status = data;

    return CY_I3C_SUCCESS;
}

/*******************************************************************************
*  Function Name: getmxds_ccc
****************************************************************************//**  
*
* Get Max Data Speed Command.
*
* \param base
* The pointer to the I3C instance.
* 
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t getmxds_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{

    uint8_t idx;
    uint16_t data;
    uint8_t dataMTR[5];
    uint32_t recvDataLen;
    cy_en_i3c_status_t retStatus;
    uint32_t respCmdPort = 0;
    cy_stc_i3c_ccc_getmxds_t *getmxds;

    retStatus = CCCSlaveAddressValidation(cccCmd->address, true, context);

    if(retStatus != CY_I3C_SUCCESS)
        return retStatus;

    cccCmd->data->len = sizeof(*getmxds); //Expects 2 or 5 bytes of data

    CCC_Get(base, cccCmd, context);

    retStatus = MasterHandleCCCResponse(base, &respCmdPort, context);

    if(CY_I3C_SUCCESS != retStatus)
        return retStatus;

    recvDataLen = respCmdPort & I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk;
    if(!((2 & recvDataLen) || (5 & recvDataLen)))
        return CY_I3C_MASTER_ERROR_M0; //ERROR_M0 - Illegally formatted CCC

    //Read data from the FIFO to the data_field of the cmd structure

    if(2 == recvDataLen)
    {
        data = Cy_I3C_ReadRxFIFO(base);
        getmxds = (cy_stc_i3c_ccc_getmxds_t *)cccCmd->data->data;

        getmxds->maxwr = (uint8_t)data;
        getmxds->maxrd = (uint8_t)(data >> 8);
    }

    //Read data from the FIFO to the data_field of the cmd structure 

    else if(5 == recvDataLen)
    {
        ReadArray(base, dataMTR, sizeof(*getmxds));
        getmxds = (cy_stc_i3c_ccc_getmxds_t *)cccCmd->data->data;
        getmxds->maxwr = dataMTR[0];
        getmxds->maxrd = dataMTR[1];

        for( idx = 2; idx < sizeof(*getmxds); idx++)
        {
            getmxds->maxrdturn[idx - 2] = dataMTR[idx]; //CHECK - if MSB of maxrdturn is copied into first element of struct array while checking 
        }
    }
    return CY_I3C_SUCCESS;

