ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/source/cy_i3c.c
}

/*******************************************************************************
*  Function Name: gethdrcap_ccc
****************************************************************************//**  
*
* Get HDR Capability Command.
*
* \param base
* The pointer to the I3C instance.
* 
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t gethdrcap_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus;
    uint32_t respCmdPort = 0;
    uint8_t data;
    cy_stc_i3c_ccc_gethdrcap_t *gethdrcap;
    
    retStatus = CCCSlaveAddressValidation(cccCmd->address, true, context);

    if(retStatus != CY_I3C_SUCCESS)
        return retStatus;

    cccCmd->data->len = sizeof(*gethdrcap); //Expects 1 byte of data
    
    CCC_Get(base, cccCmd, context);

    retStatus = MasterHandleCCCResponse(base, &respCmdPort, context);

    if(CY_I3C_SUCCESS != retStatus)
        return retStatus;


/*    if(sizeof(*gethdrcap) != (respCmdPort & I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk))
        return CY_I3C_MASTER_ERROR_M0; //ERROR_M0 - Illegally formatted CCC */

    //Read data from the FIFO to the data_field of the cmd structure
    data = Cy_I3C_ReadRxFIFO(base);

    gethdrcap = (cy_stc_i3c_ccc_gethdrcap_t *)cccCmd->data->data;
    gethdrcap->modes = data;

    return CY_I3C_SUCCESS;
}

/*******************************************************************************
*  Function Name: getaccmst_ccc
****************************************************************************//**  
*
* Get Accept Mastership Command.
*
* \param base
* The pointer to the I3C instance.
* 
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t getaccmst_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    cy_en_i3c_status_t retStatus;
    //uint32_t recvDataLen;
    uint32_t respCmdPort = 0;
    uint8_t data;
    cy_stc_i3c_ccc_getaccmst_t *getaccmst;

    retStatus = CCCSlaveAddressValidation(cccCmd->address, true, context);

    if(retStatus != CY_I3C_SUCCESS)
        return retStatus;

    cccCmd->data->len = sizeof(getaccmst); //Excepts 1 byte of data
    
    CCC_Get(base, cccCmd, context);

    retStatus = MasterHandleCCCResponse(base, &respCmdPort, context);

    if(CY_I3C_SUCCESS != retStatus)
        return retStatus;


/*    recvDataLen = respCmdPort & I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk;
    if(sizeof(*getaccmst) & recvDataLen)
        return CY_I3C_MASTER_ERROR_M0; //ERROR_M0 - Illegally formatted CCC */

    data = Cy_I3C_ReadRxFIFO(base);

    getaccmst = (cy_stc_i3c_ccc_getaccmst_t *)cccCmd->data->data;
    getaccmst->newmaster = data;

    return CY_I3C_SUCCESS;
    
}


/*******************************************************************************
*  Function Name: defslvs_ccc
****************************************************************************//**
*
* Define List of Slaves Command.
*
* \param base
* The pointer to the I3C instance.
* 
* \param cccCmd
* The pointer to the I3C CCC structure \ref cy_stc_i3c_ccc_cmd_t.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t defslvs_ccc(I3C_CORE_Type *base, cy_stc_i3c_ccc_cmd_t *cccCmd, cy_stc_i3c_context_t *context)
{
    uint8_t index;
    cy_stc_i3c_master_t *i3cMaster = &(context->i3cMaster);
    cy_stc_i3c_master_devlist_t *devList = context->devList;
    uint8_t i3cDevCnt;
    bool send = false;
    cy_stc_i3c_ccc_defslvs_t defslvs; //Stores the list to be sent - the slaves list
    cy_stc_i3c_ccc_dev_desc_t slaves[CY_I3C_MAX_DEVS];
    
    //Where to get the master related info - like bcr, dcr and    pid?!
    // The data to this CCC is prepared here

    //Check for the presence of any secondary masters on the bus
    i3cDevCnt = i3cMaster->devCount - i3cMaster->i2cDeviceCount;

    for(index = 0; index < (i3cDevCnt);)
    {
        if(!devList->i2c)
        {
            //it is an i3c device
            if((devList->i3cDevice.bcr & CY_I3C_CORE_BCR_DEVICE_ROLE_Msk) == CY_I3C_CORE_BCR_I3C_MASTER)
            {
                //The device is secondary master capable
                //Secondary Master will also have MASTER value in this field
                send = true;
            }
            index++;
        }
        devList++;
    }
    
    if(!send)
    {
        return CY_I3C_NO_SECONDARY_MASTER_DEVICES;
    }

    context->masterStatus |= CY_I3C_MASTER_BROADCAST_CCC_WR_XFER;

    //Maintain the list of devices
    devList = context->devList;

    for(index = 0; index < (i3cMaster->devCount); index++)
    {
        if(devList->i2c)
        {
            //i2c device
            slaves[index].staticAddress = (devList->i2cDevice.staticAddress) << 1;
            slaves[index].dynAddress = 0;
            slaves[index].lvr = devList->i2cDevice.lvr;
            slaves[index].bcr = 0;
        }

        else
        {
            //i3c device
            slaves[index].staticAddress = (devList->i3cDevice.staticAddress) << 1;
            slaves[index].dynAddress = (devList->i3cDevice.dynamicAddress) << 1;
            slaves[index].dcr = devList->i3cDevice.dcr;
            slaves[index].bcr = devList->i3cDevice.bcr;
        }
    }

    //DOUBT - Where to get the master info from?
    //defslvs.master = 
    defslvs.count = i3cMaster->devCount; //DOUBT - Should this count include the main master too?
    defslvs.slaves = slaves;

