ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/source/cy_i3c.c
/*******************************************************************************
*  Function Name: MasterHandleWriteInterrupt
****************************************************************************//**
*
* Handles the response queue ready status interrupt  \ref group_i3c_intr_macros 
* with HDR/SDR write TID \ref cy_en_i3c_tid_t in the response status.
*
* \param base
* The pointer to the I3C instance.
* 
* \param respCmdPort
* The value read from the response queue port register.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static void MasterHandleWriteInterrupt(I3C_CORE_Type *base, uint32_t respCmdPort, cy_stc_i3c_context_t *context)
{
    //Expected number of bytes were not transmitted, WRITE terminated early
    context->masterStatus &= (~CY_I3C_MASTER_BUSY);
    context->state = CY_I3C_IDLE;

    uint32_t dataLen;

    dataLen = (respCmdPort & I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk);

    if(NULL != context->cbEvents)
    {
        (dataLen == 0) ? context->cbEvents(CY_I3C_MASTER_WR_CMPLT_EVENT): context->cbEvents(CY_I3C_MASTER_WR_EARLY_TERMINATION_EVENT);
    }
}

/*******************************************************************************
*  Function Name: MasterHandleReadInterrupt
****************************************************************************//**
*
* Handles the response queue ready status interrupt \ref group_i3c_intr_macros
* with HDR/SDR read TID \ref cy_en_i3c_tid_t in the response status.
*
* \param base
* The pointer to the I3C instance.
* 
* \param respCmdPort
* The value read from the response queue port register.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static void MasterHandleReadInterrupt(I3C_CORE_Type *base, uint32_t respCmdPort, cy_stc_i3c_context_t *context)
{
    if(respCmdPort & I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_DATA_LENGTH_Msk)
    {
        MasterHandleDataReceive(base, context);
        context->state = CY_I3C_IDLE;
        context->masterStatus &= (~CY_I3C_MASTER_BUSY);
            
        if(NULL != context->cbEvents)
        {
            context->cbEvents(CY_I3C_MASTER_RD_CMPLT_EVENT);
        }
    }
}

/*******************************************************************************
*  Function Name: MasterHandleIBIInterrupt
****************************************************************************//**
*
* Handles the IBI interrupts \ref group_i3c_intr_macros.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
static void MasterHandleIBIInterrupt(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
        uint32_t ibiData;
        uint8_t ibiType, ibiStatus;
        cy_stc_i3c_ibi_t ibiCallback;
        
        ibiData = I3C_CORE_IBI_QUEUE_STATUS(base);

        ibiType = _FLD2VAL(I3C_CORE_IBI_QUEUE_STATUS_IBI_ID, ibiData);
        ibiStatus = _FLD2VAL(I3C_CORE_IBI_QUEUE_STATUS_IBI_RESP_STS, ibiData);

        /* Hot-join */
        if(CY_I3C_IBI_TYPE_HOT_JOIN(ibiType))
        {
            ibiCallback.event = CY_I3C_IBI_HOTJOIN;
            ibiCallback.slaveAddress = 0;
            ibiCallback.status = (0 == ibiStatus) ? (uint32_t)CY_I3C_MASTER_HOTJOIN_IBI_ACK: (uint32_t)CY_I3C_MASTER_IBI_NACK;
            
            if(NULL != context->cbIbi)
            {
                context->cbIbi(&ibiCallback);
            }
        }

        /* Mastership request */
        else if(CY_I3C_IBI_TYPE_MASTERSHIP_REQUEST(ibiType))
        {
            ibiCallback.event = CY_I3C_IBI_MASTER_REQ;
            ibiCallback.slaveAddress = (uint8_t)(_FLD2VAL(I3C_CORE_IBI_QUEUE_STATUS_IBI_ID, ibiData) & 0x7FUL); //Check the msb/lsb alignment
            ibiCallback.status = (0 == ibiStatus) ? (uint32_t)CY_I3C_MASTER_MR_IBI_ACK : (uint32_t)CY_I3C_MASTER_IBI_NACK;
            
            if(NULL != context->cbIbi)
            {
                context->cbIbi(&ibiCallback);
            }
        }

        /* Slave Interrupt Request */
        else if(CY_I3C_IBI_TYPE_SIR_REQUEST(ibiType))
        {
            ibiCallback.event = CY_I3C_IBI_SIR;
            ibiCallback.slaveAddress = (uint8_t)(_FLD2VAL(I3C_CORE_IBI_QUEUE_STATUS_IBI_ID, ibiData) & 0x7FUL);
            ibiCallback.status = (0 == ibiStatus) ? (uint32_t)CY_I3C_MASTER_SIR_IBI_ACK : (uint32_t)CY_I3C_MASTER_IBI_NACK;
            
            if(NULL != context->cbIbi)
            {
                context->cbIbi(&ibiCallback);
            }
        }
}


/*******************************************************************************
*  Function Name: RearrangeAddrTable
****************************************************************************//**
*
* Rearranges the DAT and local list of devices /ref cy_stc_i3c_master_devlist_t
* when a device detaches from the bus and thus maintaining continuous free 
* locations on the top of the DAT and local list of devices.
*
* \param base
* The pointer to the I3C instance.
* 
* \param devIndex
* The position of the device being detached.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t RearrangeAddrTable(I3C_CORE_Type *base, uint32_t devIndex,  cy_stc_i3c_context_t *context)
{
    cy_stc_i3c_device_t i3cDeviceTop;
    cy_stc_i2c_device_t i2cDeviceTop;
    uint32_t topDevPos, value;

    
    topDevPos = (context->i3cMaster.devCount) - 1;
    //Case where the device being detached is not the top device on the list
        if(devIndex != topDevPos)
        {
        /* 
            1. Check if the top device is an i2c device or i3c device
            2. Update the DAT and the local list
            3. Also check for the case if the device to be detached is the top most device? Then do not perform the exchange
        */
            if(context->devList[topDevPos].i2c)
            {
                //Top device is an i2c device
    
                //Moving the top device to the detached device position
                i2cDeviceTop = context->devList[topDevPos].i2cDevice;
                context->devList[devIndex].i2cDevice=i2cDeviceTop;
                context->devList[devIndex].i2c = true;
    
                //Erase the top position entries and mark the position free
                context->i3cMaster.freePos |= CY_I3C_BIT(topDevPos);
    
