ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/source/cy_i3c.c
                value = _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_STATIC_ADDR, i2cDeviceTop.staticAddress) |
                        I3C_CORE_DEV_ADDR_TABLE_LOC1_LEGACY_I2C_DEVICE_Msk;
    
                Cy_I3C_WriteIntoDeviceAddressTable(base, devIndex, value);
    
                Cy_I3C_WriteIntoDeviceAddressTable(base, topDevPos, 0UL);
            }
    
            else
            {
                //Top Device is an i3c device
    
                //Moving the top device to the detached device position
                i3cDeviceTop = context->devList[topDevPos].i3cDevice;
                context->devList[devIndex].i3cDevice = i3cDeviceTop;
                context->devList[devIndex].i2c = false;
                
                //Erase the top position entries and mark the position free
                context->i3cMaster.freePos |= CY_I3C_BIT(topDevPos);
                
                value = _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_DYNAMIC_ADDR, i3cDeviceTop.dynamicAddress) |
                        _VAL2FLD(I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_DYNAMIC_ADDR, i3cDeviceTop.staticAddress);
                
                Cy_I3C_WriteIntoDeviceAddressTable(base, devIndex, value);
                
                Cy_I3C_WriteIntoDeviceAddressTable(base, topDevPos, 0UL);
            }
        }
    
        //Case where the device getting detached is the top device on the list and thus no rearrangement is not required
        else
        {
            Cy_I3C_WriteIntoDeviceAddressTable(base, devIndex, 0UL);
            
            context->i3cMaster.freePos |= CY_I3C_BIT(devIndex);
        }

        return CY_I3C_SUCCESS;
}


/*******************************************************************************
*  Function Name: DeviceIBIControl
****************************************************************************//**
*
* Handles enabling and disabling of IBI events from specified devices.
*
* \param base
* The pointer to the I3C instance.
* 
* \param i3cDevice
* The pointer to the i3c device description structure \ref cy_stc_i3c_device_t.
*
* \param cccCmd
* The CCC command to be sent ENEC/DISEC.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t DeviceIBIControl(I3C_CORE_Type *base, cy_stc_i3c_device_t *i3cDevice, uint8_t cccCmd, cy_stc_i3c_context_t *context)
{
    uint32_t sirmap, bitpos, mrmap;
    cy_en_i3c_status_t retStatus;
    cy_stc_i3c_ccc_cmd_t cmd;
    cy_stc_i3c_ccc_events_t i3cCccENEC;
    cy_stc_i3c_ccc_payload_t payload;

    //Sending DISEC command
    i3cCccENEC.events = CY_I3C_CCC_EVENT_SIR | CY_I3C_CCC_EVENT_MR;
    cmd.cmd = cccCmd;
    cmd.data = &payload;
    cmd.data->len = sizeof(i3cCccENEC);
    cmd.data->data = &(i3cCccENEC.events);
    cmd.address = i3cDevice->dynamicAddress;

    retStatus = enec_disec_ccc(base, &cmd, context); //Should the response be checked for any errors?

    //In case of successful CCC command
    if(retStatus == CY_I3C_SUCCESS)
    {
        sirmap = I3C_CORE_IBI_SIR_REQ_REJECT(base);
        bitpos = CY_I3C_IBI_SIR_REQ_ID(i3cDevice->dynamicAddress);
        sirmap |= ((1UL) << bitpos); //Setting the corresponding bit to 1: 1 -> Nack the SIR from the corresponding device
        I3C_CORE_IBI_SIR_REQ_REJECT(base) = sirmap;

        mrmap = I3C_CORE_IBI_MR_REQ_REJECT(base);
        mrmap |= ((1UL) << bitpos); //Setting the corresponding bit to 1: 1 -> Nack the MR from the corresponding device
        I3C_CORE_IBI_MR_REQ_REJECT(base) = mrmap;
    }

    return retStatus;
}


/*******************************************************************************
*  Function Name: MasterHandleCCCResponse
****************************************************************************//**
*
* Validates whether the slave address is an I3C device address on the bus/ 
* broadcast address.
*
* \param address
* The address to be validated.
* 
* \param uincastOnly
* true: address is checked for I3C device address on the bus only.
* false: otherwise.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t CCCSlaveAddressValidation(uint8_t address, bool uincastOnly, cy_stc_i3c_context_t *context)
{
    uint32_t res;

    res = GetAaddrslotStatus(address, context);

    if(uincastOnly)
    {
        if(CY_I3C_ADDR_SLOT_I3C_DEV != res)
            return CY_I3C_BAD_PARAM; 
        
        context->masterStatus |=  CY_I3C_MASTER_DIRECTED_CCC_WR_XFER;
        
        return CY_I3C_SUCCESS;
    }
        
    else
    {
        //This helps to check if the device is actively present on the bus
        if((CY_I3C_ADDR_SLOT_I3C_DEV != res ) && (CY_I3C_ADDR_SLOT_RSVD != res))
            return CY_I3C_BAD_PARAM;

        if(CY_I3C_BROADCAST_ADDR == address)
        {
            context->masterStatus |= CY_I3C_MASTER_BROADCAST_CCC_WR_XFER;
        }

        else
        {
            context->masterStatus |=  CY_I3C_MASTER_DIRECTED_CCC_WR_XFER;
        }

        return CY_I3C_SUCCESS;
    }
}


/*******************************************************************************
*  Function Name: MasterHandleCCCResponse
****************************************************************************//**
*
* Handles the response of CCCs sent.
*
* \param base
* The pointer to the I3C instance.
* 
* \param resp
* The pointer to the response queue port register value.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
* \return
* \ref cy_en_i3c_status_t
*
*******************************************************************************/
static cy_en_i3c_status_t MasterHandleCCCResponse(I3C_CORE_Type *base, uint32_t *resp, cy_stc_i3c_context_t *context)
{
    uint32_t respCmdPort;
    cy_en_i3c_status_t retStatus = CY_I3C_SUCCESS;
    
