ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/mtb-pdl-cat1/drivers/source/cy_i3c.c
    //Handling the response
    do
    {
        //wait till the interrupt of response is received
    }while(0 == ((CY_I3C_INTR_RESP_READY_STS | CY_I3C_INTR_TRANSFER_ERR_STS) & Cy_I3C_GetInterruptStatus(base)));

    respCmdPort = I3C_CORE_RESPONSE_QUEUE_PORT(base);
    Cy_I3C_ClearInterrupt(base, CY_I3C_INTR_MASK);
    
    if(0 != (respCmdPort & I3C_CORE_MASTER_RESPONSE_QUEUE_PORT_ERR_STS_Msk))
    {
        retStatus = ResponseError(respCmdPort);    //unsuccessful due to transfer error
        context->masterStatus |= CY_I3C_MASTER_HALT_STATE;
    }

    Cy_I3C_SetInterruptMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
    Cy_I3C_SetInterruptStatusMask(base, CY_I3C_INTR_IBI_BUFFER_THLD_STS);
    
    return retStatus;
}

/*******************************************************************************
*  Function Name: SlaveRespReadyStsHandle
****************************************************************************//**
*
* Handles the response queue ready status interrupt \ref group_i3c_intr_macros
* for slave mode of operation.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
static void SlaveRespReadyStsHandle(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    uint32_t respCmdPort;
    uint32_t event;

    respCmdPort = I3C_CORE_RESPONSE_QUEUE_PORT(base);

    if(0 != (respCmdPort & I3C_CORE_SLAVE_RESPONSE_QUEUE_PORT_ERR_STS_Msk))
    {
        uint32_t errorEvent;
    
        errorEvent = ResponseErrorEvent(respCmdPort);
        if(NULL != context->cbEvents)
        {
            context->cbEvents(errorEvent);
        }
        return;
    }
    if(respCmdPort & I3C_CORE_SLAVE_RESPONSE_QUEUE_PORT_RX_RSP_Msk)
    {
        context->slaveRxBufferCnt = _FLD2VAL(I3C_CORE_SLAVE_RESPONSE_QUEUE_PORT_DATA_LENGTH, respCmdPort);

        if(CY_I3C_CCC_DEFSLVS != _FLD2VAL(I3C_CORE_SLAVE_RESPONSE_QUEUE_PORT_CCC_HDR_HEADER, respCmdPort))
        {
            //Receive Response - master write
            SlaveHandleDataReceive(base, context);

            I3C_CORE_RESET_CTRL(base) |= I3C_CORE_RESET_CTRL_RX_FIFO_RST_Msk;

            context->slaveStatus = CY_I3C_SLAVE_RD_CMPLT;
            event = CY_I3C_SLAVE_RD_CMPLT_EVENT;

            context->state = CY_I3C_IDLE;
            if(NULL != context->cbEvents)
            {
                context->cbEvents(event);
            }
        }
    }

    else
    {
        //Transmit Response - master read
        uint32_t size;

        size = (CY_I3C_FIFO_SIZE/4) - Cy_I3C_GetFreeEntriesInTxFifo(base); //Gets the number of entries in the Tx Fifo

        context->slaveTxBufferCnt = (context->slaveTxBufferIdx) - size; 
        context->slaveStatus = CY_I3C_SLAVE_WR_CMPLT;
        event = CY_I3C_SLAVE_WR_CMPLT_EVENT;

        context->state = CY_I3C_IDLE;
        if(NULL != context->cbEvents)
        {
            context->cbEvents(event);
        }
    }
}


/*******************************************************************************
* Function Name: SlaveHandleDataReceive
****************************************************************************//**
*
* Reads data from RX FIFO into the buffer provided by
* \ref Cy_I3C_SlaveConfigWriteBuf.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
static void SlaveHandleDataReceive(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    if(context->slaveRxBufferSize > 0UL)
    {
        context->state = CY_I3C_SLAVE_RX;
        context->slaveStatus = CY_I3C_SLAVE_RD_BUSY;
        uint32_t numToCopy;

        numToCopy =  ((CY_I3C_FIFO_SIZE/4) - Cy_I3C_GetFreeEntriesInRxFifo(base));

        ReadArray(base, context->slaveRxBuffer, numToCopy);
        context->slaveRxBufferIdx += numToCopy;
        context->slaveRxBufferSize -= numToCopy;

        context->slaveRxBuffer = &(context->slaveRxBuffer[context->slaveRxBufferIdx]);
    }
}


/*******************************************************************************
* Function Name: SlaveHandleDataTransmit
****************************************************************************//**
*
* Loads TX FIFO with data provided by \ref Cy_I3C_SlaveConfigReadBuf.
*
* \param base
* The pointer to the I3C instance.
*
* \param context
* The pointer to the context structure \ref cy_stc_i3c_context_t allocated
* by the user. The structure is used during the I3C operation for internal
* configuration and data retention. The user must not modify anything
* in this structure.
*
*******************************************************************************/
static void SlaveHandleDataTransmit(I3C_CORE_Type *base, cy_stc_i3c_context_t *context)
{
    if(context->slaveTxBufferSize)
    {
        context->state = CY_I3C_SLAVE_TX;
        context->slaveStatus = CY_I3C_SLAVE_WR_BUSY;
        
        uint32_t numToCopy;

        numToCopy = Cy_I3C_GetFreeEntriesInTxFifo(base)*4;

        if(numToCopy > (context->slaveTxBufferSize))
        {
            numToCopy = context->slaveTxBufferSize;
        }
        WriteArray(base, context->slaveTxBuffer, numToCopy);
        context->slaveTxBufferIdx += numToCopy;
        context->slaveTxBufferSize -= numToCopy;
        context->slaveTxBuffer = &context->slaveTxBuffer[context->slaveTxBufferIdx];
    }
}

#if defined(__cplusplus)
    }
#endif

#endif /* CY_IP_MXI3C */
/* [] END OF FILE */
